[
  {
    "url": "https://www.changiairport.com",
    "title": "Airport",
    "content": "Airport HELLO FROM CHANGI GO PLACES YOU'VE DREAMED OF SG60 Celebrations Join the SG60 fun with a charity walkathon, local performance, lush blooms & a dazzling outdoor light-up for everyone! Your browser does not support HTML video. I AM ARRIVING ARRIVING DEPARTING TRANSITING VISITING USEFUL INFORMATION FOR {DIRECTION} PASSENGERS What’s Happening BLACKPINK WORLD TOUR <DEADLINE> IN SINGAPORE SPEND & WIN PROMOTION Spend S$60 at Changi Airport for a chance to win a pair of tickets. Outlet Deals Shop and save: check out the latest deals! Shop more when you fly! Shop and dine at participating transit stores to be rewarded with free Changi Return e-Vouchers. Kids' Activity Booklet Get an activity booklet when you dine with kids at selected outlets! Tea Time Deal Time Thumbnail New Tea-Time, Deal Time! Visit Changi Airport public areas and unwind with specially-curated tea-time deals. Explore cities we are flying to today View All Kyoto All about onsens & ryokans Rome Top things to see & do Surabaya Perfect for family fun Cebu Best nature activities await Phnom Penh A food journey Melbourne Best day trips Penang Top nature retreats Haikou Recommendations for you Addis Ababa Ethiopia travel guide Jeonju Charming cultural town Bahrain Must-do during your visit Busan Vibrant coastal city Ipoh Weekend getaway guide Sibu Off-the-beaten destination London Best day trips Tokyo Lesser-known spots to visit Amsterdam Hidden gems to visit Bangkok New things to do Jeju The Hawaii of South Korea Hong Kong Lesser-known attractions Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 2396,
    "word_count": 367,
    "scraped_at": "2025-07-26T15:05:19.591939",
    "metadata": {
      "description": "Experience Changi Airport, a world-class service icon and destination in itself. Get flight status, travel guides, shopping and dining tips, and more! ",
      "keywords": "Changi Airport, Arrival, Departure, Transit, Flight Planner, Facilities and Services, Attractions, Shop, Dine, Discover, Changi Rewards, Changi Airport Group",
      "language": "en-IN",
      "headings": [
        {
          "level": 1,
          "text": "HELLO FROM CHANGI"
        },
        {
          "level": 1,
          "text": "Follow us"
        },
        {
          "level": 3,
          "text": "USEFUL INFORMATION FOR {DIRECTION} PASSENGERS"
        },
        {
          "level": 4,
          "text": "BLACKPINK WORLD TOUR <DEADLINE> IN SINGAPORE SPEND & WIN PROMOTION"
        },
        {
          "level": 4,
          "text": "Outlet Deals"
        },
        {
          "level": 4,
          "text": "Shop more when you fly!"
        },
        {
          "level": 4,
          "text": "Kids' Activity Booklet"
        },
        {
          "level": 4,
          "text": "Tea-Time, Deal Time!"
        },
        {
          "level": 4,
          "text": "Fly"
        },
        {
          "level": 4,
          "text": "At Changi"
        }
      ]
    },
    "content_hash": "6ce1f123bdfaaf955c35256c4c479538"
  },
  {
    "url": "https://www.changiairport.com/en/careers.html",
    "title": "Careers",
    "content": "Careers Come Make Magic With Us At Changi Airport Group, we turn airport touch points into seamless experiences using innovation and technology. WHY JOIN US Come make MAGIC with us Discover what it’s like working at Changi Airport Group, where we make magic happen in every aspect of our business – turning different airport touchpoints into seamless experiences with innovation and technology. Get a behind the scenes glimpse of how we have deployed innovative products such as the Auto-Dolly and a baggage tracking application, to transform our work at the airport terminals and airside. Explore Now How we make MAGIC with innovation How do we build the right culture and create spaces for employees to make magic? Tools, training, and a dash of tenacity. Employees are equipped to push the boundaries and conjure innovative solutions for the future of air travel. In our world, anything can become reality through innovation. Explore Now What MAGIC will you make tomorrow? What would you do if you were given a canvas to reimagine the future of air travel? At CAG, employees are encouraged to ask questions, test limits, and explore a plethora of possibilities to stay on top of the game and deliver world-class experiences. Explore Now Life at CAG – it’s MAGIC Hear from our employees as they share candidly about life at CAG. The spirit of camaraderie and community, office perk-me-ups, and overseas bonding trips all contribute to magic beyond the desk. Explore Now Meet our divisions View All AIR HUB AND CARGO DEVELOPMENT Airport Emergency Service Airport Management CHANGI AIRPORTS INTERNATIONAL (CAI) Changi East Development Commercial2.jpg Commercial CORPORATE Engineering and DEVELOPMENT Enterprise Performance and Development PEOPLE An Award-Winning Workplace Our People are our most important asset. That's why we push ourselves to be a better employer each year. We're Here to Help Explore our relevant links to help you get started on a career with us. Job Opportunities Meet Our Divisions Make Magic with Us The CAG story Accolades Our Teams Careers Careers with Changi Airport Group Careers with Changi Airports International Scholarships & Internships Scholarships Internships Useful Tips Hiring process FAQs Contact Information Follow Us Changi Sites : Careers Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 2450,
    "word_count": 384,
    "scraped_at": "2025-07-26T15:05:21.972409",
    "metadata": {
      "description": "Discover what it’s like working at Changi Airport Group, where we make magic happen in every aspect of our business.",
      "keywords": "changi airport career, changi airport jobs, changi airport vacancy, work at changi airport, changi airport group career, airport jobs, airport career singapore, singapore airport careers, cag jobs, airport career, singapore changi airport vacancy, changi group career, changi airport jobs singapore, singapore airport hiring",
      "language": "en-SG",
      "headings": [
        {
          "level": 4,
          "text": "Come make MAGIC with us"
        },
        {
          "level": 4,
          "text": "How we make MAGIC with innovation"
        },
        {
          "level": 4,
          "text": "What MAGIC will you make tomorrow?"
        },
        {
          "level": 4,
          "text": "Life at CAG – it’s MAGIC"
        },
        {
          "level": 4,
          "text": "Make Magic with Us"
        },
        {
          "level": 4,
          "text": "Our Teams"
        },
        {
          "level": 4,
          "text": "Careers"
        },
        {
          "level": 4,
          "text": "Scholarships & Internships"
        },
        {
          "level": 4,
          "text": "Useful Tips"
        },
        {
          "level": 4,
          "text": "Follow Us"
        }
      ]
    },
    "content_hash": "55474f2b88db0b812d689cf98c079245"
  },
  {
    "url": "https://www.changiairport.com/en/careers/job-opportunities.html",
    "title": "Job Opportunities",
    "content": "Job Opportunities CAREERS Join Changi Airport Group, a global aviation hub known for its excellence. Discover a range of job opportunities, from customer service to retail. JOB OPENINGS As a global aviation hub, Changi Airport offers a variety of job opportunities across different fields. Whether you're looking for part-time positions, career advancements, or entry-level openings, Changi Airport is a place where your work impacts millions of travellers around the world. Join us in creating memorable experiences for our passengers and be part of an award-winning team known for its commitment to excellence, diversity, and inclusion. Work with us Changi Airport Group (CAG) Be a part of our exceptional team managing the world’s most awarded airport. Changi Airports International (CAI) Be a part of our strategic team helping partners fulfil their potential of being world-class airports. Frequently Asked Questions About Changi Airport Group Career Opportunities Can I submit my application and/or resume by email? To ensure a holistic and fair assessment of all applications, we encourage you to apply only through our careers portal . We do not accept email applications. Will you let me know when a job has been filled? Only shortlisted applicants will be notified by our recruiters for an interview. If you haven’t heard from us in two months about your application, it is likely that we have proceeded with other candidates for that particular role. What are the application deadlines? And what if I miss the application deadline? For most of our published roles, we accept applications on a rolling basis until the position has been filled. Unless specified in the job description, there is no application deadline, although we encourage you to apply sooner rather than later. If there is a deadline specified in the job description and the deadline has lapsed, we are unable to accept further applications. When will I find out if I am selected for the role after the interview(s)? We send out offers on a rolling basis. The recruiter will contact you to discuss your offer typically within two weeks of your final round interview. Should you not have been advanced through the application process, we will notify you within two weeks of your final round interview. Due to the high volume of applications, we will not be able to provide individual feedback on the outcome of the application. Make Magic with Us The CAG story Accolades Our Teams Careers Careers with Changi Airport Group Careers with Changi Airports International Scholarships & Internships Scholarships Internships Useful Tips Hiring process FAQs Contact Information Follow Us Changi Sites : Careers Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 2850,
    "word_count": 452,
    "scraped_at": "2025-07-26T15:05:24.944378",
    "metadata": {
      "description": "Join Changi Airport Group, a global aviation hub known for its excellence. Discover a range of job opportunities, from customer service to retail.",
      "keywords": "changi airport vacancy, changi airport career opportunities, changi airport hiring, changi airport jobs, changi airport job opening, changi airport job opportunities, changi airport recruitment, changi airport job vacancy, changi airport part time jobs, changi jobs, changi airport jobs for foreigners, changi airport jobs singapore, singapore changi airport vacancy, changi airport customer service jobs, customer service jobs in changi airport, changi airport security jobs, retail jobs at changi airport",
      "language": "en-SG",
      "headings": [
        {
          "level": 3,
          "text": "Can I submit my application and/or resume by email?"
        },
        {
          "level": 3,
          "text": "Will you let me know when a job has been filled?"
        },
        {
          "level": 3,
          "text": "What are the application deadlines? And what if I miss the application deadline?"
        },
        {
          "level": 3,
          "text": "When will I find out if I am selected for the role after the interview(s)?"
        },
        {
          "level": 4,
          "text": "Make Magic with Us"
        },
        {
          "level": 4,
          "text": "Our Teams"
        },
        {
          "level": 4,
          "text": "Careers"
        },
        {
          "level": 4,
          "text": "Scholarships & Internships"
        },
        {
          "level": 4,
          "text": "Useful Tips"
        },
        {
          "level": 4,
          "text": "Follow Us"
        }
      ]
    },
    "content_hash": "05917b4c90ffe08a56eb1472b8792bd6"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/business-expertise/airport-safety-and-security.html",
    "title": "Airport Safety and Security",
    "content": "Airport Safety and Security Airport Safety and Security Your safety is paramount here at Changi Airport. Airport Emergency Service We provide a Category 10 level of fire protection, the highest possible fire protection coverage in accordance to ICAO standards. Airport Emergency Service Team Highly trained and always ready, the Airport Emergency Service (AES) remains on guard 24/7. Their mission is to protect and save lives, minimise property damage, and facilitate the quick return of the Changi aerodrome to normal safety operations. Airport Emergency Plan The Airport Emergency Plan at Changi coordinates the efforts of mutual aid agencies within the airport and its immediate vicinity. The AES team is responsible for managing the Airport Emergency Plan and takes charge of the rescue and fire-fighting and other crash site operations of this plan. This plan is tested annually in the form of full-scale aircraft crash exercises with good support from the mutual aid agencies. AES also responds to other emergency situations within the airport. This includes response to dangerous goods incidents or bomb warnings, as well as chemical or biological threats. Safety Infrastructure At all times, AES fire-fighting vehicles respond to the scene of an aircraft accident in 2 minutes, not exceeding 3 minutes and bring the fires under control within a minute upon arrival. This is swiftly followed by rescue and evacuation efforts to nearby medical facilities. In line with ICAO's recommendation to deal with aircraft crashes in the waters surrounding the airport, AES is equipped with sea rescue capabilities. It has a fleet of emergency resources based in a Sea Rescue Base off the waters of Changi Airport. Operating highly specialised emergency vessels and equipment in the event of aircraft incidents out at sea, the Sea Rescue Base is also the only hovercraft operator in Singapore. Aerodrome Safety The Aerodrome Safety Unit is involved in implementing and maintaining an effective and robust safety management system as well as ensuring compliance with safety regulatory requirements. Safety management system All levels of management and staff are committed to adopting leading practices in managing safety and risks, in line with international and national standards to achieve the highest level of safety performance. The Aerodrome Safety Unit (ASU) is involved in implementing and maintaining an effective and robust safety management system as well as ensuring compliance with safety regulatory requirements. The core functions of the ASU are to: Ensure that all safety processes within the organisation are aligned Monitor the safety performance of operational groups Manage the confidential hazard identification process Provide guidance and advice on safety management matters Changi Airport Group is committed to the establishment of a process where hazards that are likely to jeopardise safety or weaken safety defences are proactively identified and managed. Safety reporting The online hazard reporting application is a voluntary and confidential reporting system that is managed by the ASU. It provides a channel for airport users to report hazards and offer suggestions to address the hazards. No action shall be taken against any personnel who reports a safety concern unless it is due to an illegal act, gross negligence, and/or deliberate or wilful disregard of regulations or procedures. Please click here to report a hazard. In addition to the online hazard reporting channel, airport users who wish to report hazards which require immediate attention may do so at the following 24/7 hotline numbers: +65 6541 2424 (Changi Airport) +65 6481 5077 (Seletar Airport) AVIATION SECURITY Ensuring the safety and security of passengers is critical to all our airport operations. That is why, at Changi Airport, we implement the strictest security measures in line with ICAO recommendations. Security Videos To better inform our staff and visitors on airport security in Changi, we have prepared airport security videos in various languages. English Mandarin Malay Tamil Other Links Airport Operations Traffic Statistics Engineering The Future Air Hub Changi East About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 4798,
    "word_count": 720,
    "scraped_at": "2025-07-26T15:05:28.237700",
    "metadata": {
      "description": "Learn how Changi Airport Group achieves and maintains the highest standards of emergency service and safety performance across operations and more.",
      "keywords": "airport emergency service, changi airport security, singapore airport security, changi airport hotline, airport security, aviation security, safety and security, airport emergency service singapore, changi airport emergency service, airport safety and security procedures, airport safety and security, aerodrome safety",
      "language": "en-SG",
      "headings": [
        {
          "level": 4,
          "text": "About Us"
        },
        {
          "level": 4,
          "text": "Sustainability"
        },
        {
          "level": 4,
          "text": "Partnering Us"
        },
        {
          "level": 4,
          "text": "Media Hub"
        },
        {
          "level": 4,
          "text": "Airport Community"
        },
        {
          "level": 4,
          "text": "Follow Us"
        }
      ]
    },
    "content_hash": "5573b1832cb845354058327b4d7cee5a"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-belief.html",
    "title": "Our Belief",
    "content": "Our Belief Our Belief A passion for quality service is at the heart of all that we do. A PASSION FOR QUALITY SERVICE THE CHANGI EXPERIENCE QUALITY SERVICE MANAGEMENT OUR VISION AND MISSION Our Vision To be a first-in-class, leading global aviation hub run by exceptional people, connecting lives and businesses, contributing to the economic growth of Singapore. Our Mission To be a global leading airport company, anchored in the heart of Asia, pioneering safe, secure, sustainable and vibrant air hubs, ready for our future. Our Values Our values and culture guide us in everything we do. They are the foundation for our decisions and the heart of our organisation. Changi Airport Group is about world-class service, delivered through our passion and culture of excellence. We value our People. We succeed with our Partners. We are committed to our Customers. We lead in our Business. Integrity and service are at the heart of everything we do. OUR BRAND STORY Exceptional People, Connecting Lives Our brand story, ‘Exceptional People, Connecting Lives,’ is visually expressed through our logo. The lines that converge on the Changi ‘I’ symbolise how we unite to serve each customer, caring for them at every stage of their journey. The vibrant lines encircling the globe illustrate how we bring colour and energy to the world by enabling journeys and connecting lives across continents and cultures. These lines also form an ‘S,’ reflecting our commitment to growing a dynamic air hub in Singapore and fostering global connections. Quality Service Management We believe all partners in our airport community must understand the elements that make up the Changi Service DNA and align themselves with the goal of providing quality service. The elements expressed in the Changi Service DNA will foster a stronger service culture and guide the service team in their interactions with our customers at all touchpoints. Personalised To Serve vs To Engage Every customer is unique Be Welcoming Be Sincere Be Attentive Stress-free To Deliver vs To Anticipate To provide customers with peace of mind Be Knowledgeable Be Resourceful Be Reliable Positively Surprising To Satisfy To create good memories in every customer Be Proactive Be Enthusiastic Be Imaginative Delivering Quality Service We believe that everyone in the Changi family has the ability to deliver exceptional service. Our Quality Service Management team collaborates intimately with all our airport partners to deliver exceptional service. Our Changi Service DNA: Personalised, Stress-Free and Positively Surprising– make the 3 key thrusts that ensure customer centricity in all our activities. Service Process Management The Changi Experience is created by design and not by chance. It involves rethinking, redesigning and realigning airport processes to meet the growing expectations of customers. We are steadfast in creating a Changi Experience that brings delight to the customers we interact with, and to achieve a consistent level of service in our daily operations. Learning and Development People competencies are essential in the development of a successful service organisation. We are determined to train and equip our workforce to deliver excellent service to each and every customer. Emphasis is placed on inculcating new staff with the Changi Service DNA. Our core service skills training programme is designed to equip every individual with the skill sets to deliver the Changi way of service. Continuous learning efforts are an integral part of the learning and development roadmap for all airport staff. Service-Driven Initiatives Feedback from our customers sets the foundation for our work, and help us continuously improve our service standards. We seek to connect, communicate, commend, and collaborate with our airport community to drive service excellence through these through service-driven initiatives: a) Creating a high level of Service Awareness b) Promoting contribution with Awards and Recognition c) Seeking out collaborative opportunities through Agency Engagement We reward our service workforce for their good service, exemplify their excellent service acts, and encourage a sense of team responsibility. We also work with our airport partners to ensure all our customers enjoy a delightful and unforgettable Changi Experience. Other Links Explore other relevant links to help you get started and learn more about our airport community. Our Story Our Leadership Awards & Accolades Changi Airports International About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 5119,
    "word_count": 771,
    "scraped_at": "2025-07-26T15:05:30.796656",
    "metadata": {
      "language": "en-SG",
      "headings": [
        {
          "level": 4,
          "text": "About Us"
        },
        {
          "level": 4,
          "text": "Sustainability"
        },
        {
          "level": 4,
          "text": "Partnering Us"
        },
        {
          "level": 4,
          "text": "Media Hub"
        },
        {
          "level": 4,
          "text": "Airport Community"
        },
        {
          "level": 4,
          "text": "Follow Us"
        }
      ]
    },
    "content_hash": "0eaa9f7a4db59d52e644da50a8dd5b3e"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/business-expertise.html",
    "title": "Business Expertise",
    "content": "Business Expertise Business Expertise Our full range of business functions to run the world's most awarded airport Air Hub & Cargo Development Our extensive global connections can help grow your airline and cargo businesses. Explore Airport Operations Efficient operations & airside management ensure we run like clockwork. Explore Changi East Building for the future to secure Changi Airport’s position as a leading air hub. Explore Retail Development Maximising revenue streams by pioneering fresh retail experiences and supporting our partners. Explore Engineering the Future Building a dynamic infrastructure that offers room for future expansion. Explore Safety and Security Enforcing the highest standards of safety and security to give you peace of mind. Explore Traffic Statistics Monthly statistics on passenger, air freight and commercial aircraft movements. Explore About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 1490,
    "word_count": 205,
    "scraped_at": "2025-07-26T15:05:32.760257",
    "metadata": {
      "description": "Find out how Changi Airport Group manages Changi Airport to keep it running smoothly, and grow its capacity to meet travellers' demands.",
      "language": "en-SG",
      "headings": [
        {
          "level": 4,
          "text": "About Us"
        },
        {
          "level": 4,
          "text": "Sustainability"
        },
        {
          "level": 4,
          "text": "Partnering Us"
        },
        {
          "level": 4,
          "text": "Media Hub"
        },
        {
          "level": 4,
          "text": "Airport Community"
        },
        {
          "level": 4,
          "text": "Follow Us"
        }
      ]
    },
    "content_hash": "6043516c5602e10c1eb77a5e505334ce"
  },
  {
    "url": "https://www.changiairport.com/en/corporate.html",
    "title": "Corporate",
    "content": "Corporate Soar to new heights with us RECOMMENDED FOR YOU Leasing Opportunities Find out how we can help your business reach international audiences. Advertising Opportunities Showcase your brand at the world’s most awarded airport. Airline Partnerships Learn how we revolutionise airport retail with partners. ABOUT CHANGI AIRPORT GROUP Our Story & Beliefs Find out all you need to know about Changi and it’s rich aviation history. Learn more Our Subsidiaries Discover the array of subsidiaries and affiliates enriching our company’s ecosystem. Learn more Our Leaders Introducing the inspirational leaders who propel Changi Airport Group’s excellence and progress. Learn more What We Do Air Hub Development We strengthen Changi Airport's connectivity and attractiveness as a vibrant air hub. Read More Airport Operations and Management We manage the operational needs of Changi and Seletar Airports. Read More Retail Management We grow together with our concession partners through continuous innovation. Read More Systems & Technology We provide high quality airport infrastructure for the sustained development of Changi as a world-class air hub. Read More The World’s Most Awarded Airport Recognised awards to date 699 View All Awards Deficiency - Free 2023 International Federation of Air Line Pilots' Association 78th IFALPA Regional Conference 1981 - 2023 Best Airport by Size (over 40mil) and Region (Asia-Pacific) Airports Council International Airport Service Quality 2018 - 2023 Best Airport DestinAsian Readers' Choice Awards 2006 - 2020, 2022 - 2024 Latest News View All News Statistics Changi Airport’s operating indicators for Q2 2025 22 Jul 2025 Jewel Events SG60 celebrations take off at Changi Airport and Jewel with star-studded concert, charity walk, and a dazzling floral extravaganza 25 Jun 2025 Corporate CAI Changi Airport Group signs Memorandum of Understanding with Haikou Meilan International Airport to strengthen cooperation in aviation 16 Jun 2025 Corporate Changi Airport Group awards contract for the construction of Terminal 5’s intra-terminal tunnels 10 Jun 2025 Corporate Fact Sheet: Changi Airport 30 May 2025 Corporate Changi Airport Group results for the year ended 31 March 2025 24 May 2025 Partner with us Whether be it leasing, advertising or investing in the Changi Airport brand, we have an abundance of resources and opportunities for collaboration. See Our Consulting Portfolio Advertise With Us Lease With Us Learn More BUILD YOUR CAREER AT CHANGI CAREER QUICKLINKS Why Join Changi? We offer you the prestige and pride of working in a world-class environment, with abundant opportunities to learn and grow. Read more Meet Our Team At Changi Airport, different divisions come together to make our airport the world's most awarded. Read more About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 3399,
    "word_count": 503,
    "scraped_at": "2025-07-26T15:05:34.990210",
    "metadata": {
      "description": "Official site of Changi Airport Group—a world-class service icon, as well as manager and operator of Singapore Changi Airport, a world-class aviation hub.",
      "language": "en-SG",
      "headings": [
        {
          "level": 1,
          "text": ""
        },
        {
          "level": 2,
          "text": "Partner with us"
        },
        {
          "level": 4,
          "text": "ABOUT CHANGI AIRPORT GROUP"
        },
        {
          "level": 4,
          "text": "Air Hub Development"
        },
        {
          "level": 4,
          "text": "Airport Operations and Management"
        },
        {
          "level": 4,
          "text": "Retail Management"
        },
        {
          "level": 4,
          "text": "Systems & Technology"
        },
        {
          "level": 4,
          "text": "Deficiency - Free 2023"
        },
        {
          "level": 4,
          "text": "Best Airport by Size (over 40mil) and Region (Asia-Pacific)"
        },
        {
          "level": 4,
          "text": "Best Airport"
        }
      ]
    },
    "content_hash": "cf1ed5c28ffad0ec022b157307167169"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/business-expertise/airport-operations-and-management.html",
    "title": "Airport Operations and Management",
    "content": "Airport Operations and Management Airport Operations and Management Efficient operations and management ensure our airport runs like clockwork. TERMINAL OPERATIONS Daily Operations 24/7, 365 days a year, the airport never sleeps. Together with our airport partners, our operations team works relentlessly so that passengers travelling through Changi Airport always enjoy a stress-free experience. Experience Creation Creating a magical experience at Changi Airport is at the heart of everything we do. We offer a wide array of facilities, such as movie theatres, entertainment zones, snooze lounges and gardens. Like our clean and green city, our terminals are also filled with lush greenery.. Planning for Future Developments Planning ahead gets us ready to tackle future challenges and demands. As such, we design new passenger terminals that can adapt to future changes, as well as enhance and transform the passenger experience. One of the bold and revolutionary ideas we implemented is Fast and Seamless Travel (FAST). Now in full operation at Changi Airport, the automated system allows passengers to print their boarding passes and bag tags, as well as check in their luggages themselves. AIRSIDE MANAGEMENT Daily Operations Airside Management makes it safe for aircrafts to take off, land, and taxi at Changi and Seletar Airport. The airside operations team is responsible for many complex and vital tasks on the runways, taxiways, aprons, and beyond airport fences. These tasks include the allocation of aircraft stands and baggage claim belts, testing and issuance of airside driving and vehicular permits, safety inspections, responding to accidents and incidents, audits to mitigate unsafe work practices and wildlife hazard management. Airside Driving Centre To operate any vehicle within Changi Airport's airside, a driver must obtain an Airside Driving Permit. Read more Airside Safety Induction Briefing As part of CAG’s ongoing efforts to enhance safety at Changi's Airside, we have introduced the Airside Safety Induction Briefing. Read more Other Links Airside Driving Centre Airside Safety Induction Briefing Traffic Statistics Engineering The Future Retail Management Safety and Security Changi East About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 2834,
    "word_count": 410,
    "scraped_at": "2025-07-26T15:05:37.342958",
    "metadata": {
      "description": "It takes well-honed precision to run the world’s most acclaimed airport. Learn how the Changi Airport team manages ground, terminal, and airside operations.",
      "language": "en-SG",
      "headings": [
        {
          "level": 4,
          "text": "Airside Driving Centre"
        },
        {
          "level": 4,
          "text": "Airside Safety Induction Briefing"
        },
        {
          "level": 4,
          "text": "About Us"
        },
        {
          "level": 4,
          "text": "Sustainability"
        },
        {
          "level": 4,
          "text": "Partnering Us"
        },
        {
          "level": 4,
          "text": "Media Hub"
        },
        {
          "level": 4,
          "text": "Airport Community"
        },
        {
          "level": 4,
          "text": "Follow Us"
        }
      ]
    },
    "content_hash": "a08eef10fe33700b7e9f35241c25ccb0"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/partnering-us/airport-concessions/airport-retail.html",
    "title": "Airport Retail",
    "content": "Airport Retail Airport Retail The innovative initiatives that differentiate us amongst the dynamic retail environment. REVOLUTIONISING AIRPORT RETAIL The dynamic travel industry is characterised by a fast-changing retail landscape reflective of constantly evolving consumer preferences. To strengthen our position as a competitive air hub, we innovate and create fresh concepts to inject vitality into our transit and public malls, delivering a revolutionary retail experience to the public, passengers and the airport community. Creative Retail Strategies We firmly believe in growing together with our concession partners through continuous innovation and effective collaboration. Through pioneering fresh retail experiences, we are able to offer a wealth of opportunities for retail brands to showcase themselves to the world, creating an ideal place for them to build and grow their businesses. Fresh Retail Experiences Engaging Platforms Unwavering Support Fresh Retail Experiences Changi Pay Changi Pay is your go-to digital payment solution for effortless transactions at Changi Airport and beyond. Partnering with us unlocks exclusive benefits for your customers to enjoy instant savings, collect exclusive weekly offers and rewards while shopping and dining. Join us in enhancing the payment experience for your customers! Find out more Changi First In collaboration with our esteemed partners, we regularly curate exclusive product launches and events to delight travellers. By partnering with us, you’ll amplify your brand's pioneering spirit and secure a first-mover advantage, leaving a lasting impression on your target audience. Find out more You Shop, We Absorb Changi Airport offers an airport-wide 'Flying or Not, You Shop, We Absorb' programme, allowing retailers in the public areas to absorb 9% GST with the free Changi Rewards membership, and creating exceptional value for shoppers. Find out more Engaging Platforms iShopChangi: Our E-commerce Platform Flying or not, shoppers can shop without tax on iShopChangi. As travellers, they can also enjoy the convenience of tax and duty-free purchases from the comfort of their homes or hotel rooms, eliminating the need to rush while in transit at Changi Airport. Find out more Changi Rewards: Loyalty Programme Our rewards programme allows customers to earn points for every dollar spent. Accumulated points can be redeemed for exclusive savings, rewards or rebates. Membership is free. Find out more Unwavering Support Changi Shopping Concierge From luxury and beauty, to fashion and gifts, you can count on our team of expert personal shoppers to be the additional brand ambassadors for your brand. In partnership with you, we collaborate to elevate our passengers’ Changi Retail Experience and build awareness for the products and promotions you offer. Find out more Quality Service Management (QSM) Your continued success is ours too. We work closely with you and your staff to deliver the exceptional Changi Experience: Personalised, Stress-free and Positively Surprising. Customer Discovery and Insights We leverage our experienced team of business analysts and comprehensive data sources to establish a holistic view of our customers, carry out market research, and formulate retail strategies to support your growth and development at Changi Airport. Supporting the Growth of our Stakeholders We are committed to supporting the growth of our airport stakeholders, through the lease of quality rentable premises and competitive aeronautical charges. Quality Rentable Premises It is the collaborative effort of all airport stakeholders that drive the efficient operations at Changi Airport. We lease quality rentable premises, such as offices, lounges and warehouses/storerooms including those within our Changi Airfreight Centre. Competitive Aeronautical Charges Changi Airport is dependent on the successes of our airline partners and airport stakeholders. As such, we ensure our airport charges, including aircraft landing fees, parking. Other Links Airport Operations Traffic Statistics Engineering The Future Safety and Security Changi East About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 4734,
    "word_count": 679,
    "scraped_at": "2025-07-26T15:05:40.370881",
    "metadata": {
      "description": "Discover Changi Airport's innovative retail ideas to deliver unique experiences, exclusive promotions, and a diverse brand selection.",
      "keywords": "innovative retail singapore, changi millionaire, innovative retail, retail experience, airport retail, changi airport retail",
      "language": "en-SG",
      "headings": [
        {
          "level": 4,
          "text": "Changi Pay"
        },
        {
          "level": 4,
          "text": "Changi First"
        },
        {
          "level": 4,
          "text": "You Shop, We Absorb"
        },
        {
          "level": 4,
          "text": "iShopChangi: Our E-commerce Platform"
        },
        {
          "level": 4,
          "text": "Changi Rewards: Loyalty Programme"
        },
        {
          "level": 4,
          "text": "Changi Shopping Concierge"
        },
        {
          "level": 4,
          "text": "Quality Service Management (QSM)"
        },
        {
          "level": 4,
          "text": "Customer Discovery and Insights"
        },
        {
          "level": 4,
          "text": "About Us"
        },
        {
          "level": 4,
          "text": "Sustainability"
        }
      ]
    },
    "content_hash": "b53a0e1ca6a02e11e7dfb425db6f5c30"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/business-expertise/air-hub-development.html",
    "title": "Air Hub Development",
    "content": "Air Hub Development AIR HUB & CARGO DEVELOPMENT We're the region's best gateway to the Asia-Pacific region. The Changi Airport Connectivity Value Proposition Future-ready Infrastructure With 5 passenger terminals, 3 airfreight terminals and 3 runways ready around 2030, Changi Airport is future-proof for the next era of aviation. The Region's Premier Gateway Ranked the top 5 busiest airport in the world in 2023 by Airports Council International World, Changi Airport links Singapore to some 150 cities globally, with close to 100 airlines operating more than 6,900 flights weekly. See our traffic statistics Large Family of Airlines and Alliances With close to 100 airlines in our family and counting, Changi Airport is home to all alliances. oneworld SkyTeam Star Alliance Partner us A Trusted Air Cargo Hub With excellent operating indicators and a growing list of accolades, it is no wonder that Changi Airport is one of the largest airports in the world for international air cargo traffic. See our air cargo operations OTHER LINKS Airport Operations Engineering the Future Innovative Retail Safety and Security Changi East About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 1744,
    "word_count": 256,
    "scraped_at": "2025-07-26T15:05:42.381143",
    "metadata": {
      "description": "Find out how our connectivity to the world, current and future value proposition, and local dynamic economy makes us a world-class premier aviation hub.",
      "language": "en-SG",
      "headings": [
        {
          "level": 4,
          "text": "About Us"
        },
        {
          "level": 4,
          "text": "Sustainability"
        },
        {
          "level": 4,
          "text": "Partnering Us"
        },
        {
          "level": 4,
          "text": "Media Hub"
        },
        {
          "level": 4,
          "text": "Airport Community"
        },
        {
          "level": 4,
          "text": "Follow Us"
        }
      ]
    },
    "content_hash": "f8ba99ef6d9a4f85c2fdbf088fde9c66"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us.html",
    "title": "About Us",
    "content": "About Us About Us ABOUT CHANGI AIRPORT GROUP As the group behind the world-renowned Changi Airport, we are dedicated to delivering exceptional airport experiences. Here, we share our story of growth, and our commitment to innovation, service excellence and sustainable development. Driven by our purpose, Exceptional People, Connecting Lives, we believe in the potential of our people to create extraordinary impact in the communities we serve. Our Story & Belief The driving force behind our continued success and renowned Changi Experience. Learn more Our Subsidiaries Diversifying our business for customers and partners through top-tiered services to transform travel experiences. Learn more Our Leadership A highly experienced team steers the growth and development of Changi Airport. Learn more Our Expertise Our full range of business functions to run the world's most awarded airport. Learn more FREQUENTLY ASKED QUESTIONS ABOUT CHANGI AIRPORT GROUP What is Changi Airport's history and when was it established? Changi Airport's history traces back to its establishment in 1981, evolving from the relocation from Paya Lebar Airport to meet the burgeoning demand for air travel. This strategic move was aimed at positioning Singapore as a major hub in the global aviation network, marking the beginning of Changi's journey towards becoming a world-class airport. How has Changi Airport evolved over the years? Over the years, Changi Airport has undergone significant transformations, marked by the continuous expansion and introduction of innovative facilities and services. From the opening of Terminal 1 in 1981 to the launch of Jewel Changi Airport in 2019, Changi has consistently enhanced its infrastructure to improve passenger experience and operational efficiency. These developments reflect Changi Airport Group's commitment to innovation and excellence in serving the needs of international travellers and the local community. What are the main facilities available at Changi Airport? Changi Airport is renowned for its comprehensive range of facilities that cater to the needs and preferences of travellers. Key facilities include Jewel Changi Airport , a multi-dimensional lifestyle destination; the world's first butterfly garden in an airport and Kinetic Rain art installation; state-of-the-art airline lounges ; extensive retail and dining options; and innovative services like automated boarding gates and baggage handling systems. These facilities underscore Changi Airport Group's dedication to creating memorable experiences for passengers. How does Changi Airport contribute to sustainability and environmental conservation? Changi Airport Group is deeply committed to environmental conservation. Our airport sustainability initiatives include emissions, waste, and water management, alongside the establishment of risk thresholds and mitigation measures for climate resilience. View Changi Sustainability Reports to find out more about our efforts. What community engagement initiatives does Changi Airport participate in? Changi Airport Group actively engages with the community through various initiatives focused on education, youth development, and social responsibility. Programmes such as the Changi Foundation support youths-at-risk, while partnerships with local organisations foster community well-being. These initiatives reflect Changi's commitment to giving back to the community and making a positive impact beyond its operational boundaries. How many terminals does Changi Airport have, and what are their features? Changi Airport currently boasts four terminals, each designed with unique features to enhance the passenger experience. From the thematic gardens and cultural exhibits in Terminal 1 to the cutting-edge design and automated systems in Terminl 4 , each terminal showcases Changi's dedication to comfort, efficiency, and aesthetic appeal. These terminals collectively offer a seamless and enjoyable travel experience for millions of passengers each year. What future developments or expansions are planned for Changi Airport? Looking ahead, Changi Airport Group has outlined ambitious plans for future developments, including the Changi East project . This initiative aims to accommodate the anticipated growth in passenger traffic and enhance Changi's capacity and offerings. Plans include a new runway, a mega terminal, and additional facilities to ensure Changi remains at the forefront of global aviation, ready to meet the evolving demands of the future. About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 5128,
    "word_count": 718,
    "scraped_at": "2025-07-26T15:05:44.492770",
    "metadata": {
      "description": "Discover Changi Airport Group's journey of excellence, innovation, and community engagement. Learn about our history, facilities, and future plans.",
      "keywords": "changi airport group, changi group, about changi airport",
      "language": "en-SG",
      "headings": [
        {
          "level": 3,
          "text": "FREQUENTLY ASKED QUESTIONS ABOUT CHANGI AIRPORT GROUP"
        },
        {
          "level": 3,
          "text": "What is Changi Airport's history and when was it established?"
        },
        {
          "level": 3,
          "text": "How has Changi Airport evolved over the years?"
        },
        {
          "level": 3,
          "text": "What are the main facilities available at Changi Airport?"
        },
        {
          "level": 3,
          "text": "How does Changi Airport contribute to sustainability and environmental conservation?"
        },
        {
          "level": 3,
          "text": "What community engagement initiatives does Changi Airport participate in?"
        },
        {
          "level": 3,
          "text": "How many terminals does Changi Airport have, and what are their features?"
        },
        {
          "level": 3,
          "text": "What future developments or expansions are planned for Changi Airport?"
        },
        {
          "level": 4,
          "text": "About Us"
        },
        {
          "level": 4,
          "text": "Sustainability"
        }
      ]
    },
    "content_hash": "b9507ad3be929e579fe37f392cb94167"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/future-developments.html",
    "title": "Future Developments",
    "content": "Future Developments Future Developments Building for the future to secure Changi Airport’s position as a leading air hub ABOUT CHANGI EAST ABOUT TERMINAL 5 MILESTONES FAQS What is changi east? Spanning a massive 1,080 hectares, the Changi East development will provide future capacity for Changi Airport. The development will serve to secure Singapore’s air hub status and ensure its continued competitiveness and relevance. As Changi Airport’s largest expansion project to date, the development includes: Changi Airport’s fifth terminal, Terminal 5 (T5) A three-runway system The construction of tunnels and other underground systems Landside and aviation support facilities The Changi East Industrial Zone Key Highlights T5 and Supporting Structure Terminal 5 is a project undertaken by Changi Airport Group, the Civil Aviation Authority of Singapore, and the Ministry of Transport. T5 will be linked to the other terminals at Changi Airport, allowing the expanded Changi Airport to be operated as a single, integrated airport for ease of transfer between different terminals with airfield operational efficiency. New facilities, such as navigation aids, airfield lighting systems and a fire station will also be constructed. Three-Runway System The existing third runway, previously used only by the military, has been extended from 2.75km to 4km to handle larger passenger aircraft, and converted for joint military-civilian use. Under the three-runway programme, almost 40km of new taxiways will also be built to connect the runway with the rest of Changi Airport. This three-runway system is scheduled for operationalisation by the mid-2020s. Changi East Industrial Zone Expansion of Cargo Facilities Changi Airport’s cargo facilities, currently located at the Changi Airfreight Centre, will be expanded to the Changi East Industrial Zone (CEIZ) as part of the Changi East Development. The zone will be developed for airfreight, air express and Maintenance, Repair and Operations (MRO) activities. Together with the remodelled Changi Airfreight Centre, Changi’s handling capabilities will increase from 3 million tonnes per annum today, to 5.4 million tonnes per annum in its end-state, when the project is completed. A Smart Air Cargo Hub The future expanded air cargo hub will be smarter, more connected and more efficient. The use of data and technology with a focus on automation will reduce processing time, and improve productivity and cargo visibility. Strategic infrastructure planning will ensure greater operational efficiency, with dedicated lanes for autonomous guided vehicles. Direct access to freighter aircraft from cargo and express terminals will also speed up cargo flows. With environmental and workplace sustainability in mind, the new air cargo hub will feature eco-friendly handling equipment, convenient amenities and a land transport network for staff. TERMINAL 5 Terminal 5 is an integral part of the Changi East development, which will position Singapore to capture future growth opportunities in the region. Terminal 5’s roof design is an assembly of overlapping roof leaves with varying heights, creating a variety of spaces that are more human-scale. This provides a cosy feel within the mega terminal. The curved shapes of the roof allow natural light to filter through, evoking a sense of dynamism and excitement of flight. All the buildings in Terminal 5 will be connected via an automated people mover system. There will also be an extension to Terminal 2, where passengers can connect to the rest of Changi Airport. Arriving passengers can conveniently hop onto the automated people mover system which will bring them directly to the Arrival Immigration Hall. Passengers are greeted by Terminal 5's vertical gardens as they make their way to the baggage claim belt, providing them with a warm welcome to Singapore. The sculpted columns and ceilings of the underground MRT station mimic rain trees, creating a connection to nature. T5 will be a place of shared experiences where precious memories with friends and family are forged. Terminal 5 (T5) is located within the 1,080-hectare Changi East development. The terminal is designed with the flexibility to be built in two phases, in line with traffic growth. In its first phase, T5 will be able to handle about 50 million passenger movements per year and is expected to be operational around the mid-2030s. It will allow Changi Airport to significantly increase its handling capacity and strengthen its position as a premier air hub as travel demand continues to increase in the decades ahead. T5 will be linked to the existing terminals at Changi Airport, so that the airport can operate as a single integrated air hub. It will house a ground transportation centre that brings together train, bus, taxi and other transport services. T5 also offers the possibility of enhanced air and sea connectivity - for more seamless passenger travel, including convenient connections to neighbouring destinations via ferry services. Drawing on lessons learnt from the Covid-19 pandemic, T5 has also been designed with the flexibility to operate as smaller sub-terminals when needed. Specialised provisions to reduce the transmission of diseases will also be deployed in T5, including contactless systems at passenger touchpoints and enhanced ventilation systems. As a new gateway to Singapore, T5 offers new possibilities and will bring new surprises. It will reinforce Changi Airport’s status as a national icon and be a place of shared experiences across generations of Singaporeans, where precious memories are forged with friends and family. A MEGA-YET-COSY TERMINAL T5’s design concept is characterised by a unique collection of overlapping curved roofs with varying heights. The ‘roof leaves’ break the mega terminal building into smaller spaces that are more human scale. Combined with natural light and landscaping at appropriate spaces, the terminal will have a cosy yet uplifting feel. To make it easier for passengers to get around the terminal, an automated people mover (APM) system will be used to reduce walking distances. Together with travellators, walking distances in T5 will be comparable to Changi’s current terminals. The APM network will also link T5 to Terminal 2, facilitating seamless transfers to the other terminals. A TECHNOLOGICALLY-INSPIRED TERMINAL T5 will leverage technology to automate and digitalise airport operations. This will enable the airport to operate at scale in a sustainable manner, with reduced reliance on manpower. In addition to various ongoing trials to enhance airport operations via automation, video analytics, AI and robotics are also being trialled for wider implementation in T5. Aircraft 360 Video analytics and AI help monitor aircraft turnaround activities and predict potential delays in flight departures. With full visibility of the situation, ground handlers can better deploy resources to mitigate potential delays. Autonomous Vehicle Autonomous vehicles will be used to shuttle passengers and staff in the airside. They raise workforce productivity, optimise airside road traffic and potentially improve road safety. Autonomous Baggage Transfer Autonomous baggage tractors transport baggage between terminals and aircraft, improving efficiency in bad weather, and enhancing passenger service levels. They can also load and unload Unit Load Devices using bi-directional robotic arms, eliminating the need for intermediate equipment. Automated Aerobridge Docking The automated aerobridge docking system will allow remote docking of both aerobridges onto a wide-body aircraft simultaneously, improving productivity and operational efficiency. Robotic Baggage Handling Robotic baggage handlers can operate in the terminals and under rain and lightning conditions at the aircraft stands, enabling continuous operations and timely delivery of baggage for passengers. Clean Energy Apron From 2025, all new airside light vehicles, forklifts and tractors will be electric. In the coming years, the airside electric vehicle charging network will triple to 300 points. Terminal 5 will be able to support a fully electric airside fleet. A SUSTAINABLE TERMINAL T5 will be a Green Mark Platinum Super Low Energy Building, as certified by the Building and Construction Authority.",
    "length": 8313,
    "word_count": 1252,
    "scraped_at": "2025-07-26T15:05:47.249492",
    "metadata": {
      "description": "The Changi East development includes Terminal 5 and serves to secure Singapore’s air hub status and ensure its continued competitiveness and relevance",
      "language": "en-SG",
      "headings": [
        {
          "level": 2,
          "text": "2013"
        },
        {
          "level": 2,
          "text": "2014"
        },
        {
          "level": 2,
          "text": "2018"
        },
        {
          "level": 2,
          "text": "2020"
        },
        {
          "level": 2,
          "text": "2022"
        },
        {
          "level": 2,
          "text": "2025"
        },
        {
          "level": 3,
          "text": "What is Changi East and why is this development project necessary?"
        },
        {
          "level": 3,
          "text": "Why is there a need to build T5 and how will it benefit travellers?"
        },
        {
          "level": 3,
          "text": "When will Changi East be completed and how soon can we benefit from it?"
        },
        {
          "level": 3,
          "text": "How will the Changi East development be funded?"
        }
      ]
    },
    "content_hash": "4c08d7788d10d93bc43575a4791c0f48"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/traffic-statistics.html?linkedListSection=airfreight",
    "title": "Traffic Statistics",
    "content": "Traffic Statistics Air Traffic Statistics PASSENGER AIRFREIGHT COMMERCIAL AIRCRAFT Passenger Movements Jun 2025: 5.88m passenger movements Monthly Breakdown of Passenger Movements Month 2025('000) 2024 ('000) Change (%) 2025 vs 2024 2019 ('000) Change (%) 2025 vs 2019 January 6,160 5,430 13.4 5,660 8.8 February 5,440 5,350 1.7 5,130 6.0 March 5,620 5,730 (1.9) 5,630 (0.2) April 5,780 5,400 6.9 5,580 3.5 May 5,820 5,480 6.2 5,407 7.7 June 5,880 5,620 4.6 5,820 1.1 July 5,700 5,910 August 5,730 5,900 September 5,400 5,470 October 5,650 5,650 November 5,740 5,720 December 6,410 6,410 TOTAL 34.700 67,700 5.1 68,300 4.4 Year-to-date: 34.7m passenger movements AirFreight Movements Jun 2025: 173k airfreight movements Monthly Breakdown of Air Freight Movements (tonnes) Month 2025('000) 2024 ('000) Change (%) 2025 vs 2024 2019 ('000) Change (%) 2025 vs 2019 January 160 156 2.3 171 (6.7) February 143 143 0 137 4.8 March 177 176 0.8 185 (4.0) April 167 158 5.9 156 7.0 May 176 170 3.3 172 2.5 June 173 157 9.8 162 6.7 July 174 170 August 166 169 September 172 170 October 178 170 November 173 178 December 171 175 TOTAL 996 1,995 3.7 2,010 (1.4) Year-to-date: 996k airfreight movements Commercial Aircraft Movements Jun 2025: 31.0k aircraft movements Monthly Breakdown of Commercial Aircraft Movements Month 2025('000) 2024 ('000) Change (%) 2025 vs 2024 2019 ('000) Change (%) 2025 vs 2019 January 33.1 30.1 9.9 32.7 1.1 February 29.2 28.8 1.4 30.0 (2.2) March 31.6 30.4 4.0 32.4 (2.3) April 31.0 29.1 6.6 31.5 (1.3) May 31.7 30.1 5.1 31.7 0 June 31.0 30.0 2.9 31.4 (1.5) July 31.0 32.4 August 31.2 32.4 September 30.0 31.2 October 31.3 32.0 November 30.8 31.6 December 33.2 33.3 TOTAL 188 366 5.0 382 (1.0) Year-to-date: 188k aircraft movements Note: All figures are rounded off to three significant figures and are accurate as of 22 July 2025. The figures may be updated from time to time. The statistics published on this website are provided for general information purposes only and should not to be treated nor relied upon by any person as any kind of advice for any circumstances. As the statistics have been provided to Changi Airport Group (\"CAG\") by third parties, CAG is in no position to verify the veracity or correctness of any of the published statistics. CAG shall not be liable for any damage or loss suffered by any party as a result of the use of, or reliance upon the statistics or any information published on this website. About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 3062,
    "word_count": 493,
    "scraped_at": "2025-07-26T15:05:49.535680",
    "metadata": {
      "description": "Changi Airport serves more than 100 airlines flying to 150 cities worldwide. Click here for the latest traffic statistics.",
      "language": "en-SG",
      "headings": [
        {
          "level": 4,
          "text": "About Us"
        },
        {
          "level": 4,
          "text": "Sustainability"
        },
        {
          "level": 4,
          "text": "Partnering Us"
        },
        {
          "level": 4,
          "text": "Media Hub"
        },
        {
          "level": 4,
          "text": "Airport Community"
        },
        {
          "level": 4,
          "text": "Follow Us"
        }
      ]
    },
    "content_hash": "c7296d0664343e1cd8dd45a079465310"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/accolades.html",
    "title": "Accolades",
    "content": "Accolades Accolades Thanks to you, we've risen to become one of the world's most awarded airports. OUR PRIDE Changi Airport has been recognised with 699 awards to date. 2025 S/N DETAILS NO. OF TIMES WON YEARS 1 DestinAsian Best Airport Readers' Choice Awards 19 2006 - 2020, 2022 - 2025 2 Airports Council International Best Airport by Size (over 40mil) and Region (Asia-Pacific) Award Service Quality 7 2018 - 2024 3 TTG China Best Airport (Overseas) 2 2018, 2025 4 Skytrax World Best Airport 2025 World Airport Awards 13 2000, 2006, 2010, 2013 - 2020, 2023, 2025 5 Skytrax World’s Best Airport Dining 2025 World Airport Awards 8 2013 - 2014, 2016 - 2018, 2023 - 2025 6 Business Traveller Middle East Best Airport in the World Business Traveller Middle East Awards 2025 19 2004 - 2020, 2024 - 2025 7 Travel + Leisure Southeast Asia Best Airport in Asia Pacific Travel + Leisure Luxury Travel Awards APAC 3 2023 - 2025 2024 S/N DETAILS NO. OF TIMES WON YEARS 1 International Federation of Air Line Pilots' Associations (IFALPA) Deficiency - Free 2023 78th IFALPA Regional Conference 43 1981 - 2023 2 Airports Council International Best Airport by Size (over 40mil) and Region (Asia-Pacific) Award Service Quality 6 2018 - 2023 3 DestinAsian Best Airport Readers' Choice Awards 18 2006 - 2020, 2022 - 2024 4 Skytrax Best Airport in Asia World Airport Awards 13 2000, 2006, 2010, 2013 - 2020, 2023 - 2024 5 Business Traveller Middle East Best Airport in the World Business Traveller Middle East Awards 2024 18 2004 - 2020, 2024 6 TTG Asia Best Airport of the Year TTG Travel Awards 19 2002, 2004-2019, 2023-2024 7 Travel Weekly Asia Best Airport in Asia Pacific Readers’ Choice Awards 6 2015, 2018 - 2019, 2022-2024 8 Business Traveller Asia Pacific Best Airport in Asia Pacific Business Traveller Asia-Pacific Awards 15 2010 – 2024 Business Traveller Asia Pacific Best Airport in the World Business Traveller Asia-Pacific Awards 33 1992 – 2024 9 Forbes Travel Guide Best International Airport Forbes Trvel Guide Verified Air Travel Award 1 2024 10 Forbes Travel Guide Best Airport Design Forbes Trvel Guide Verified Air Travel Award 1 2024 11 Business Traveller UK Best Airport in the World Business Traveller UK Awards 37 1988 - 2024 Business Traveller UK Best Airport in Asia Pacific Business Traveller UK Awards 3 2022-2024 12 ULTRA Travel Best Airport in the World ULTRA Travel Awards 15 2007 – 2019, 2022, 2024 13 Airlines Ratings World's Best Airport Readers’ Choice Awards 1 2024 14 Condé Nast Traveller India Favourite Airport in the World Readers' Travel Awards* 14 2011- 2024 15 Travel + Leisure India Best International Airport Travel + Leisure India Best Awards 13 2011- 2024 16 Smart Travel Asia Best Airport Worldwide Best in Travel Poll 2024 3 2020, 2023-2024 17 Business Traveller US Best Airport in the World Business Traveller US Awards 30 (1991-1999, 2001-2008, 2010-2015, 2017- 2020,2022-2024) 18 Business Traveller Asia Pacific Best Airport in Tax Free Shopping Business Traveller Asia-Pacific Awards 1 2024 19 Forbes Travel Guide Best Airport Wellness Experience (Jewel Changi Airport) Forbes Trvel Guide Verified Air Travel Award 1 2024 20 Business Traveller Germany Best Airport Worldwide Business Traveller Germany Awards 30 1993 - 2020, 2023-2024 Accolades received by Changi Airport Group (2024) 2023 S/N DETAILS NO. OF TIMES WON YEARS 1 International Federation of Air Line Pilots' Associations (IFALPA) Deficiency - Free 2022 77th IFALPA Regional Conference 42 1981 - 2022 2 Airports Council International Best Airport by Size (over 40mil) and Region (Asia-Pacific) Award Service Quality 5 2018 - 2022 3 DestinAsian Best Airport Readers' Choice Awards 17 2006 - 2020, 2022 - 2023 4 Skytrax World Best Airport 2023 World Airport Awards 12 2000, 2006, 2010, 2013 - 2020, 2023 5 Travel + Leisure Asia Pacific Best Airport 2023 Travel + Leisure Luxury Awards 1 2023 6 Travel + Leisure US Best International Airport in the World 2023 Travel + Leisure World's Best Awards 11 2013 - 2023 7 The Trazees Favourite Airport in Asia The Trazees 2023 2 2019, 2023 8 Business Traveller UK Best Airport in the World Business Traveller UK Awards 36 1988 - 2023 9 Business Traveller UK Best Airport in Asia Pacific Business Traveller UK Awards 2 2022 - 2023 10 TTG Travel Awards Best Airport of the World Travel Hall of Fame 18 2002, 2004-2019, 2023 11 Conde Nast Traveler UK, US Top Airport of the World Readers' Choice Awards 4 2019- 2021, 2023 12 Travel Weekly Asia Best Airport in Asia Pacific Readers' Choice Awards 5 2015, 2018-2019, 2022-2023 13 Business Traveller Asia Pacific Best Airport in the World Business Traveller Asia-Pacific Awards 32 1992 - 2023 14 Business Traveller Asia Pacific Best Airport in Asia Pacific Business Traveller Asia-Pacific Awards 14 2010 - 2023 15 Business Traveller US Best Airport in the World Business Traveller US Awards 29 (1991-1999, 2001-2008, 2010-2015, 2017- 2020,2022-2023) 16 Conde Nast Traveller India Favourite International Airport Readers' Travel Awards 13 2011- 2023 17 Travel + Leisure India Best International Airport Travel + Leisure India Best Awards 12 2012-2023 18 Best Airport Worldwide Best in Travel Poll 2023 Smart Travel Asia 2 2020, 2023 Accolades received by Changi Airport Group (2023) 2022 S/N DETAILS NO. OF TIMES WON YEARS 1 International Federation of Air Line Pilots' Associations (IFALPA) Deficiency - Free 2020 75th IFALPA Regional Conference 40 1981 - 2020 2 Airports Council International Best Airport by Size (over 40mil) and Region (Asia-Pacific) Award Service Quality 3 2018 - 2020 3 Club Med Best Airport Layover Club Med 1 2021 4 Travel + Leisure US Best International Airport in the World Travel + Leisure World’s Best Awards Survey 1 2013 - 2021 5 Newsweek International Airport Newsweek Future of Travel Award 1 2021 6 Condé Nast Traveler Top Airport in the World Condé Nast Traveler Readers' Choice Award 3 2019 - 2021 7 Business Traveller Asia Pacific Best Airport in the World 2021 Business Traveller Asia-Pacific Awards 30 1992 - 2021 8 Business Traveller Asia Pacific Best Airport in Asia-Pacific 2021 Business Traveller Asia-Pacific Awards 12 2010 - 2021 9 Business Traveller UK Best Airport in the World Business Traveller UK Awards 34 1988 - 2021 10 Conde Nast Traveller Middle East Favourite International Airport Readers’ Choice Awards 2020 2 2020 - 2021 11 Condé Nast Traveler, India Favourite International Airport Conde Nast Traveller India Readers' Travel Awards 11 2011 - 2021 12 Global Traveler Best Overall Airport in the World GT Tested Awards 7 2006, 2016 - 2021 13 Travel + Leisure India Best International Airport Travel + Leisure India’s Best Awards 2021 10 2012 - 2021 Accolades received by Changi Airport Group (2021) 2021 S/N DETAILS NO. OF TIMES WON YEARS 1 International Federation of Air Line Pilots' Associations (IFALPA) Deficiency - Free 2020 75th IFALPA Regional Conference 40 1981 - 2020 2 Airports Council International Best Airport by Size (over 40mil) and Region (Asia-Pacific) Award Service Quality 3 2018 - 2020 3 Club Med Best Airport Layover Club Med 1 2021 4 Travel + Leisure US Best International Airport in the World Travel + Leisure World’s Best Awards Survey 1 2013 - 2021 5 Newsweek International Airport Newsweek Future of Travel Award 1 2021 6 Condé Nast Traveler Top Airport in the World Condé Nast Traveler Readers' Choice Award 3 2019 - 2021 7 Business Traveller Asia Pacific Best Airport in the World 2021 Business Traveller Asia-Pacific Awards 30 1992 - 2021 8 Business Traveller Asia Pacific Best Airport in Asia-Pacific 2021 Business Traveller Asia-Pacific Awards 12 2010 - 2021 9 Business Traveller UK Best Airport in the World Business Traveller UK Awards 34 1988 - 2021 10 Conde Nast Traveller Middle East Favourite International Airport Readers’ Choice Awards 2020 2 2020 - 2021 11 Condé Nast Traveler, India Favourite International Airport Conde Nast Traveller India Readers' Travel Awards 11 2011 - 2021 12 Global Traveler Best Overall Airport in the World GT Tested Awards 7 2006, 2016 - 2021 13 Travel + Leisure India Best International Airport Travel + Leisure India’s Best Awards 2021 10 2012 - 2021 Accolades received by Changi Airport Group (2021) 2020 S/N DETAILS NO. OF TIMES WON YEARS 1 Wanderlust Top Worldwide Airport Wanderlust Reader Travel Awards 2020 18 1999, 2001, 2003, 2005, 2007 - 2020 2 Destinasian Best Airport Readers' Choice Awards 15 2006 - 2020 3 International Federation of Air Line Pilots' Associations (IFALPA) Deficiency - Free 2019 74th IFALPA Regional Conference 39 1982 - 2019 4 Airports Council International Best Airport by Size (over 40mil) and Region for 2019 Airport Service Quality Awards 2 2018 - 2019 5 Skytrax World's Best Airport 2020 World Airport Awards 11 2000, 2006, 2010, 2013 - 2020 6 Conde Nast Traveller, Middle East Favourite International Airport Readers’ Choice Awards 2020 1 2020 7 Travel + Leisure US Best International Airport in the World Travel + Leisure World’s Best Awards Survey 8 2013 - 2020 8 Smart Travel Asia Best Airport Worldwide Best of the Decade Award 2020 1 2020 9 Condé Nast Traveler Top Airport in the World Condé Nast Traveler Readers' Choice Award 2 2019 - 2020 10 Business Traveller Asia Pacific Best Airport in the World 2020 Business Traveller Asia-Pacific Awards 29 1992 - 2020 11 Business Traveller Asia Pacific Best Airport in Asia-Pacific 2020 Business Traveller Asia-Pacific Awards 11 2010 - 2020 12 Business Traveller UK Best Airport in the World Business Traveller UK Awards 33 1988 - 2020 13 Business Traveller Middle East Best Airport in the WorldBusiness Traveller Middle East Awards 2020 17 2004 - 2020 14 Travel + Leisure India Best International Airport Travel + Leisure India’s Best Awards 2020 9 2012 - 2020 15 AFAR Best International Airport AFAR Travelers' Award 1 2020 16 Condé Nast Traveler, India Favourite International Airport Conde Nast Traveller India Readers' Travel Awards 10 2011 - 2020 17 Global Traveler Best Overall Airport in the World GT Tested Awards 6 2006, 2016 - 2020 18 Business Traveller Germany Best Airport Worldwide Business Traveller Germany Awards 2019 28 1993 - 2020 19 Business Traveler US Best Airport in the World Best in Business Travel Awards 27 1991 - 1999, 2001 - 2008, 2010 - 2015, 2017 - 2020 Accolades received by Changi Airport Group (2020) 2019 S/N DETAILS NO. OF TIMES WON YEARS 1 Wanderlust Top Worldwide Airport Wanderlust Travel Awards 2019 17 1999, 2001, 2003, 2005, 2007 - 2019 2 International Federation of Air Line Pilots' Associations (IFALPA) Deficiency - Free 2018 73rd IFALPA Regional Conference 38 1982 - 2018 3 DestinAsian Best Airport in the World Reader's Choice Awards 14 2006 - 2019 4 Airports Council International Best Airport by Size (over 40mil) 2018 Airport Service Quality Awards 5 2012 - 2014, 2016, 2018 5 Airports Council International Best Airport by Region (Asia-Pacific) 2018 Airport Service Quality Awards 3 2004, 2016, 2018 6 Skytrax World's Best Airport 2019 World Airport Awards 10 2000, 2006, 2010, 2013 - 2019 7 Business Traveller Middle East Best Airport in the World Business Traveller Middle East Awards 2019 16 2004 - 2019 8 Fodor's Travel Best International Airport Fodor's Travel Awards 2019 (Inagural) 1 2019 9 Smart Travel Asia No.1 Airport Worldwide 2019 Best in Travel Poll 11 2008 - 2010, 2012 - 2019 10 Business Traveller Germany Best Airport Worldwide Business Traveller Germany Awards 2019 26 1993 - 2019 11 Travel + Leisure US Best International Airport in the World Travel + Leisure World’s Best Awards Survey 7 2013 - 2019 12 trazeetravel.com Favorite Airport in Asia The Trazees 1 2019 13 Business Traveller Asia Pacific Best Airport in the World 2019 Business Traveller Asia-Pacific Awards 28 1992 - 2019 14 Business Traveller Asia Pacific Best Airport in Asia-Pacific 2019 Business Traveller Asia-Pacific Awards 10 2010 - 2019 15 Whereverfamily.com Best Family-Friendly International Airport Wherever Awards 2019 2 2018 - 2019 16 TTG Asia Travel Hall of Fame - Best Airport of The Year TTG Travel Awards 17 2002, 2004 - 2019 17 Condé Nast Traveler Top Airport in the World Condé Nast Traveler Readers' Choice Award 1 2019 18 Business Traveller UK Best Airport in the World Business Traveller UK Awards 32 1988 - 2019 19 World Travel Awards Asia's Leading Airport World Travel Awards Asia & Oceania Gala Ceremony 2019 16 2001 - 2002, 2006 - 2019 20 Travel Weekly Asia Best Airport - Asia Pacific Travel Weekly Asia 2019 Readers’ Choice Awards 3 2015, 2018 - 2019 21 Surface Surface Travel Awards - Stations & Terminals 2019 Surface Travel Awards 1 2019 22 Selling Travel (Formerly Selling Long Haul) Best Overseas Airport Selling Travel Awards 15 2000 - 2003, 2005, 2009 - 2015, 2017 - 2019 23 Business Traveller China Best Airport in the World Business Traveller China Awards 15 2005 - 2019 24 Travel + Leisure India Best International Airport Travel+Leisure India’s Best Awards 2019 8 2012 - 2019 25 Conde Nast Traveller India Favourite Airport Conde Nast Traveller India Readers’ Travel Awards 9 2011 - 2019 26 World Travel Awards World's Leading Airport World Travel Awards Grand Final Gala Ceremony 2019 14 1994, 2006 - 2008, 2010 - 2019 25 Business Traveler US Best Airport in the World Best in Business Travel Awards 26 1991 - 1999, 2001 - 2008, 2010 - 2015, 2017 - 2019 26 Global Traveler Best Overall Airport in the World GT Tested Awards 5 2006, 2016 - 2019 27 Ultra Travel Best Airport in The World Ultimate Luxury Travel Related Awards (ULTRAs) 13 2007 - 2019 Accolades received by Changi Airport Group (2019) AWARD-WINNING WORKPLACE RANDSTAD AWARDS 2nd Most Attractive Employer (2021) 2nd Most Attractive Employer (2020) 2nd Most Attractive Employer (2019) 1st Most Attractive Employer (2018) 2nd Most Attractive Employer (2017) 1st Most Attractive Employer (2016) 2nd Most Attractive Employer (2015) 3rd Most Attractive Employer (2014) 5th Most Attractive Employer (2013) BRIGHTSPARKS SURVEY No. 1 Bonded Scholarship Provider for Top GCE ‘A’ Level and IB Graduates (2018-2020) HRM AWARDS Best C-Suite Leader (2018) Best Workplace Culture & Engagement (2018) Best Employer Branding (2016) Best Recruitment Strategies (2016) Hays Award for Employer of Choice (2017) HR EXCELLENCE AWARDS Excellence in Crisis Management and Recovery (Gold) (2021) Excellence in Workplace Wellbeing (Bronze) (2020) Excellence in CSR Strategy (Gold) (2019) Employer of the Year (Gold) (2018) Excellence in Workplace Culture (Gold) (2018) Excellence in Employer Branding (Silver) (2016) SINGAPORE HEALTH AWARDS Corporate Achievement (2019) Corporate Excellence (2017) STRONG DIGITAL PRESENCE Awards List BEST PR CAMPAIGN BY AN IN-HOUSE COMMUNICATIONS TEAM PR Awards 2018 BEST IDEA (SOCIAL) - GOLD MARKies Awards 2017 Singapore SOCIAL CAMPAIGN OF THE YEAR - GOLD Hall of Fame 2017 EXCELLENCE IN RETAIL AND F&B Awards List BEST AIRPORT FOR CUSTOMER SERVICE The Travel Retail Awards BEST DIGITAL AND SOCIAL MEDIA OFFER The Travel Retail Awards BEST AIRPORT \"SENSE OF PLACE\" The Travel Retail Awards BEST AIRPORT FOR RETAIL ENVIRONMENT The Travel Retail Awards BEST MARKETING ACTIVATION DFNI Asia Awards for Travel-Retail Excellence Other links Our story Our belief Our leadership Changi airports international About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 15857,
    "word_count": 2586,
    "scraped_at": "2025-07-26T15:05:52.895919",
    "metadata": {
      "description": "The awards and accolades we’ve received reflect our continued pursuit of excellence in service delivery, customer experience and employee development.",
      "language": "en-SG",
      "headings": [
        {
          "level": 3,
          "text": "2025"
        },
        {
          "level": 3,
          "text": "2024"
        },
        {
          "level": 3,
          "text": "2023"
        },
        {
          "level": 3,
          "text": "2022"
        },
        {
          "level": 3,
          "text": "2021"
        },
        {
          "level": 3,
          "text": "2020"
        },
        {
          "level": 3,
          "text": "2019"
        },
        {
          "level": 3,
          "text": "RANDSTAD AWARDS"
        },
        {
          "level": 3,
          "text": "BRIGHTSPARKS SURVEY"
        },
        {
          "level": 3,
          "text": "HRM AWARDS"
        }
      ]
    },
    "content_hash": "4759e7531cfb673a42a1afb0e5d52dda"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/our-subsidiaries.html",
    "title": "Our Subsidiaries",
    "content": "Our Subsidiaries Our Subsidiaries We redefine the air travel experience, in Singapore and abroad. EXPANDING OUR BUSINESS Our subsidiaries actively pursue the delivery of a first-in-class travel experience for our customers and partner airports. Changi Airports International Changi Airports International is wholly-owned by Changi Airport Group, the company managing Changi Airport — consistently acknowledged as one of the best airports in the world. With years of airport management and development knowledge, we are proud to play a part in elevating standards of airports everywhere. Our broad range of business activities includes investment in foreign airports, provision of consultancy, and implementation of airport management services. Find out more Changi Travel Services Changi Travel Services operates Changi Recommends, a travel concierge providing an extensive range of leisure and business services such as ChangiWiFi, SIM cards, foreign exchange, corporate travel management and airline general sales.​ Find out more Jewel Changi Airport Jewel Changi Airport (Jewel) is a joint venture between Changi Airport Group (CAG) and CapitaLand Development (CLD), with CAG holding a 51% stake. With its unique combination of top-notch retail offerings, attractions and aviation facilities amid a garden setting, Jewel’s multi-faceted facility demonstrates the perfect combination of the strengths of CAG and CLD in their respective domains to enliven an airport development, with retail at its core. Find out more OTHER LINKS Our Story Our Belief Our Leadership Future Developments About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 2201,
    "word_count": 308,
    "scraped_at": "2025-07-26T15:05:55.049462",
    "metadata": {
      "description": "We redefine the air travel experience, in Singapore and abroad.",
      "language": "en-SG",
      "headings": [
        {
          "level": 4,
          "text": "Our Story"
        },
        {
          "level": 4,
          "text": "Our Belief"
        },
        {
          "level": 4,
          "text": "Our Leadership"
        },
        {
          "level": 4,
          "text": "Future Developments"
        },
        {
          "level": 4,
          "text": "About Us"
        },
        {
          "level": 4,
          "text": "Sustainability"
        },
        {
          "level": 4,
          "text": "Partnering Us"
        },
        {
          "level": 4,
          "text": "Media Hub"
        },
        {
          "level": 4,
          "text": "Airport Community"
        },
        {
          "level": 4,
          "text": "Follow Us"
        }
      ]
    },
    "content_hash": "46735cc925ff663d43b1bd60d1cd7d6e"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/learning-journeys.html",
    "title": "Learning Journeys",
    "content": "Learning Journeys LEARNING JOURNEYS By Changi Experience Studio JOIN US ON A LEARNING ADVENTURE Come along for a fun journey of discovery and learn what makes Singapore Changi Airport an embodiment of world-class service, efficiency and positively surprising experiences for travellers and non-travellers alike. Learning Journeys are conducted at Changi Experience Studio , located within Jewel Changi Airport. FOR ADULTS FOR STUDENTS LEARNING JOURNEYS & WORKSHOPS FOR ADULTS Select from a specially curated range of programmes for adults to gain a deeper understanding of how Changi Airport is managed and its innovation journey. Find out about the inner workings of airport operations, experience creation and what it takes to develop a global air hub. With defined learning outcomes for each module, participants will be able to take away transferrable concepts from the programmes and apply them at their own workplace or for personal growth. Programmes are tailored for different learner profiles across all levels. Corporate participants can benefit from the sharing of real-world industry insights. View Brochure for Adults PROGRAMME MODULES Managing The World's Most-awarded Airport Learn about CAG's airport management philosophy which has underpinned Changi Airport's development and growth over the past 40 years. Planning The Best Airport Of The Future Drawing heavily from CAG's experience with Terminal 4 and Jewel Changi Airport, get a glimpse of CAG's planning philosophy, design principles and approach to innovation and transformation in designing an airport that is ready for the future. Digital Innovation: A Way Of Working Learn about how CAG drives its digital innovation efforts and how it is building a culture of innovation. Gain insights into how CAG's digital squads solve problems and create value through 'out-of-the-box' ways, and the projects that have materialised as a result. The Changi Way Of Service Behind the world's most awarded airport is a vast community of more than 200 airport partners and 50,000 staff across diverse functions, coming together to deliver first-class service across all airport touchpoints. Learn more about CAG's holistic Quality Service Management programme, designed to build a culture of service excellence. Forging a Sustainable Changi While Changi Airport continues to push the boundaries and set the standards for the World’s Best Airport and air hub, sustainability remains an integral part of our business. Learn about CAG's sustainability approach and the initiatives being implemented at Changi Airport to achieve a more sustainable future. Curating Art At Changi Changi Airport houses one of Singapore's largest art collections, ranging from kinetic installations to sculptures and paintings. Learn about the key themes that anchor Changi Airport's art collection and gain a deeper appreciation of the curatorial journey of a commissioned art piece at Changi Airport. Horticulture Bootcamp Learn about how CAG has integrated greenery into Changi Airport's design, the creative process of designing landscaping exhibits, and the work behind caring for one of the world's largest indoor collection of plants. Creating a Stress-Free Changi Experience As one of the busiest international aviation hub in the world, waiting in lines are inevitable during peak hours. Learn about how CAG redesigned processes and reimagined passengers’ journeys to remove the hassle of waiting. Design Thinking at Changi Airport Service design plays an important role in ensuring a human-centric way of designing passenger experience. Learn how CAG applies Design Thinking methodology in service design and leverage various tools to understand, design and test ideas that bring positive impact to our passengers’ lives. ACTIVITIES & WORKSHOPS The Amazing Jewel Quest for Team Bonding Embark on an exciting quest around Jewel Changi Airport to discover fun facts about Jewel and Changi Airport! Use your senses to look for clues and conquer challenges as you explore the wonders of the airport at this quest! As part of the fun, learn about how the airport works through games and interactive exhibits at Changi Experience Studio. Service Design Thinking Workshop Go in-depth and discover how CAG applies Design Thinking methodology in service design, leveraging various tools to understand, design and test ideas that bring positive impact to our passengers’ lives. Participants will also be challenged to reflect on their own experience with service design and how they might approach it. Through the workshop, participants will have the opportunity to put into practice Design thinking framework and tools on their own problem statements. LEARNING JOURNEYS & WORKSHOPS FOR STUDENTS Select from a specially curated range of programmes for students to gain a deeper understanding of how Changi Airport is managed and its innovation journey. Find out more about the inner workings of airport operations, experience creation and what it takes to develop a leading air hub. With defined learning outcomes for each module, participants will be able to take away key concepts and formulate new learning mindsets. Programmes are tailored to different learner profiles. For primary and secondary students, there are modules designed to fit National Education learning objectives too. View Brochure for Students PROGRAMME MODULES The Singapore Story: Changi Airport Chapter Learn first-hand from an airport manager about the history and development of Changi Airport, and how the airport community stayed resilient while battling against Covid-19 at the frontline. Careers In The World's Most-awarded Airport Embark on this interactive learning journey and discover the various job opportunities available across Changi Airport. From Airport Management, Ground Handling to Ground Operations, students will learn more about the potential roles. Managing The World's Most-awarded Airport Learn about CAG's airport management philosophy which has underpinned Changi Airport's development and growth over the past 40 years. Planning The Best Airport Of The Future Drawing heavily from CAG's experience with Terminal 4 and Jewel Changi Airport, get a glimpse of CAG's planning philosophy, design principles and approach to innovation and transformation in designing an airport that is ready for the future. A Day In The Life Of A Changi Airport Horticulturist Learn how CAG has integrated greenery into Changi Airport's design, the creative process of designing landscaping exhibits, and the work behind caring for one of the world's highest indoor collection of plants. Changi Art Odyssey Embark on a guided sketchwalk around Changi Airport and learn about how art is integrated with the airport's experience, and how art pieces are curated. Curating Art At Changi Learn about the key themes that anchor Changi Airport's art collection and gain a deeper appreciation of the curatorial journey of a commissioned art piece at Changi Airport. Growing The Changi Air Hub Learn from CAG's air hub team on how they develop Changi Airport as a global air hub and what it takes for them to maintain Changi's leading position in a highly competitive global aviation landscape. Creating a Stress-Free Changi Experience As one of the busiest international aviation hub in the world, waiting in lines are inevitable during peak hours in Changi Airport. Learn about how CAG redesigned processes and reimagined passengers’ journey to remove the hassle from waiting. Design Thinking at Changi Airport Service design plays an important role in ensuring a human-centric way of designing passenger experience. Learn how CAG applies Design Thinking methodology in service design and leverage various tools to understand, design and test ideas that bring positive impact to our passengers’ lives. ACTIVITIES & WORKSHOPS Interactive Learning Journey at Changi Experience Studio Embark on an interactive learning journey at digital attraction, Changi Experience Studio! Through 10 difference content zones featuring interactive exhibits, games and shows, students will learn about the history and development of Changi Airport, our air hub connectivity, airport operations behind the scenes, and the spirit of teamwork and community behind the world’s leading air hub. Find out more about Changi Experience Studio Quests for Interactive Learning Enhance your Learning Journey or Changi Experience Studio visit with a fun quest around the airport! Choose the Amazing Airport Quest to learn fun facts about the airport, or Sustainable Airport Quest to find out about the airport's green efforts. Spice up the fun as you race around the airport and Jewel with your school mates as you conquer challenges and create memorable moments! Design Thinking Workshop for Young Learners: A Day in the Life of a Changi Trolley Dive into the world of design thinking and hone your child's creative problem-solving skills in this highly educational, introductory-level workshop. From empathising with problems and identifying the needs of travellers, to prototyping their imagination of an airport of the future, they will have fun while learning to create user-centric solutions. Design Thinking Workshop for Tertiary Students: Service Design Go in-depth and discover how CAG applies Design Thinking methodology in service design, leveraging various tools to understand, design and test ideas that bring positive impact to our passengers’ lives. Participants will also be challenged to reflect on their own experience with service design and how they might approach it. Through the workshop, participants will have the opportunity to put into practice Design thinking framework and tools on their own problem statements. ENQUIRIES AND CUSTOMISED TOURS We're happy to connect with you. Contact us at learn@changiairport.com for enquiries and customisation requests. For customisation requests, please also share your requirements with us. Get in touch FREQUENTLY ASKED QUESTIONS Are the learning journey programmes suitable for learners of all ages? Changi Experience Studio's Learning Journey Programmes are tailored for different learner profiles ranging from students across all levels to adult learners. For instance, for upper primary and secondary students, there are modules designed to fit National Education learning objectives, while corporate learners can benefit from sharing of real-world industry insights and applications. There are certain topics which are the same for both adult learners and students. Is the content delivered the same? Content and activities are tailored for different levels of learner profiles, to suit both adult learners and students as relevant. How much does the learning journey programme cost? The prices differ for the various modules and group size. For corporates or schools who would like to add on tours, team bonding activities, attraction or camp experiences, the team is able to customise a programme for you. Do write in to learn@changiairport.com to enquire. Is a tour included as part of all Learning Journey programmes/modules? The learning journey programme is a sit-down sharing session and includes a FAQ section. A tour is considered an add-on for the programme. If you would like to add on a tour, do write in to learn@changiairport.com to enquire. Is there a minimum or maximum group size? Minimum group size is 30 pax per booking. Maximum group size applies to the various venues. Do write in to us at learn@changiairport.com to discuss how we can meet your needs. How far in advance do bookings need to be made? To ensure that availability of speakers (airport professionals) and our venues (used to conduct the programmes), do write in to us early to enquire/confirm your booking. About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 12360,
    "word_count": 1867,
    "scraped_at": "2025-07-26T15:05:56.623006",
    "metadata": {
      "description": "A specially curated range of programmes to learn about the inner workings of the airport. Benefit from the sharing of real-world industry insights. ",
      "language": "en-SG",
      "headings": [
        {
          "level": 3,
          "text": "Are the learning journey programmes suitable for learners of all ages?"
        },
        {
          "level": 3,
          "text": "There are certain topics which are the same for both adult learners and students. Is the content delivered the same?"
        },
        {
          "level": 3,
          "text": "How much does the learning journey programme cost?"
        },
        {
          "level": 3,
          "text": "Is a tour included as part of all Learning Journey programmes/modules?"
        },
        {
          "level": 3,
          "text": "Is there a minimum or maximum group size?"
        },
        {
          "level": 3,
          "text": "How far in advance do bookings need to be made?"
        },
        {
          "level": 4,
          "text": "About Us"
        },
        {
          "level": 4,
          "text": "Sustainability"
        },
        {
          "level": 4,
          "text": "Partnering Us"
        },
        {
          "level": 4,
          "text": "Media Hub"
        }
      ]
    },
    "content_hash": "71a7cbf7bdaab72692d67d36459dab6f"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/our-sustainability-efforts.html",
    "title": "Our Sustainability Efforts",
    "content": "Our Sustainability Efforts Sustainability Building a shared future for generations to come. Environmental Sustainability Doing our part for responsible and sustainable growth. Learn More Changi Foundation Connecting with youths today, empowering them for a better tomorrow. Learn More About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 898,
    "word_count": 118,
    "scraped_at": "2025-07-26T15:05:59.569262",
    "metadata": {
      "description": "Sustainability is at the heart of our operations here at Singapore Changi Airport. Find out more about our sustainability efforts and initiatives.",
      "keywords": "singapore sustainability, sustainability efforts in singapore, singapore airport sustainability, airport sustainability",
      "language": "en-SG",
      "headings": [
        {
          "level": 4,
          "text": "About Us"
        },
        {
          "level": 4,
          "text": "Sustainability"
        },
        {
          "level": 4,
          "text": "Partnering Us"
        },
        {
          "level": 4,
          "text": "Media Hub"
        },
        {
          "level": 4,
          "text": "Airport Community"
        },
        {
          "level": 4,
          "text": "Follow Us"
        }
      ]
    },
    "content_hash": "534df22c24d6aeaf22efe52d83306eea"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/our-sustainability-efforts/environment.html",
    "title": "Environment",
    "content": "Environment Environment A Sustainable Changi - connecting and conserving our world. Our Approach Our Targets Our Environmental Stories Our Reports & Policies Changi Carbon Offsets Our Approach At Changi, we take a holistic view towards environmental sustainability, focusing on emissions, waste, water, climate resilience and beyond. Emissions Reduction Waste Management Water Conservation Climate Resilience Emissions Reduction We are committed to working with our partners to reduce emissions both in the air and on the ground. Together, we will transition to cleaner energy for our terminals, as well as vehicles and aircraft operating at Changi Airport. Waste Management We strive to reduce waste at source and promote circularity in our operations, such as through recycling concrete and composting horticultural waste. Water Conservation We adopt a water optimisation strategy to reduce water consumption and increase water efficiency. At Changi, NEWater – a high-grade recycled water produced from treated used water – forms the majority of our water consumption. Climate Resilience We ensure that our critical infrastructure and operations remain resilient against climate change, with special focus on mitigating increasing rainfall intensity, rising sea levels, higher temperatures and increased lightning frequency. Our targets -20% Scope 1 and 2 emissions We target a 20% reduction in our Scope 1 and 2 emissions by 2030 against a FY18/19 baseline, even as we continue to grow our business. Level 3 ACI Airport Carbon Accreditation We continue to maintain our Airport Carbon Accreditation (ACA) Level 3 certification as a commitment to pursuing sustainable growth. ISO ISO 14001:2015 Certification We continue to maintain our ISO 14001:2015 certification across energy and emissions, waste management and water management. OUR ENVIRONMENTAL STORIES Emissions Reduction Waste Management Water Conservation Climate Resilience Sustainable Processes Changi’s first Positive Energy Building Changi Nexus One is a super-low energy building that can generate more renewable energy that it consumes. Read more Singapore’s Largest Single-Site Rooftop Solar Project A key milestone in CAG’s journey of transitioning towards renewable energy. Read More Tackling emissions in the air and on the ground Efforts to reduce our Scope 3 emissions include using Sustainable Aviation Fuel and enabling the electrification of ground handling partners. Read more Changi takes big steps to go green Our first step towards enabling a fully electric fleet of baggage handling tractors at Changi Airport. Read more Keeping Changi cool with less energy As our top energy consuming equipment, we continuously aim to raise the building energy efficiency of our air-conditioning systems. Read more Encouraging recycling in Changi Airport CAG encourages good recycling habits with the public and staff through various waste minimisation initiatives. Read more Horticultural composting - Putting our waste to good use An example of promoting circularity in our daily operations – composting our horticultural waste for a second lease of life. Read more Rotary waste drum Raising the efficiency of waste management through an improved waste compactor. Read more Paving the way to a sustainable future Through an engineering collaboration with a local university, we reduced our consumption of raw materials by featuring recycled concrete in our aircraft parking bay rehabilitation projects. Read more Closing the water loop in Changi’s nursery CAG’s nursery features a circular system that recycles water for irrigation. Read more Water conservation efforts at Changi CAG adopts a multi-pronged approach in raising our water efficiency across sanitary fittings and air-conditioning systems. Read more Enhancing heat resilience for airside personnel Our heat stress management strategy to protect our airside personnel against rising temperatures. Read more Building resilience into our operations Against the escalating impact of climate change, we are preparing our runways for more intense rainfalls and higher temperatures. Read more Green Procurement through a lifecycle approach Enabling sustainable consumption through our Green Procurement policy. Read more OUR REPORTS & POLICIES From 2022/2023, our sustainability indicators have been incorporated within our Annual Reports. Please refer to our archives for past Sustainability Reports. View Latest Report View Past Reports Our Environmental Policies We adhere to a set of environmental policies as part of our commitment to sustainability. Find out more CHANGI CARBON OFFSETS Join us in our commitment to upkeeping a healthy planet for future generations of travellers to explore. Calculate and offset the carbon emissions from your flight today. Find out more About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 5414,
    "word_count": 782,
    "scraped_at": "2025-07-26T15:06:01.139367",
    "metadata": {
      "description": "Discover our strategies for pursuing environmentally sustainable growth at Changi Airport",
      "language": "en-SG",
      "headings": [
        {
          "level": 2,
          "text": "OUR REPORTS & POLICIES"
        },
        {
          "level": 2,
          "text": "CHANGI CARBON OFFSETS"
        },
        {
          "level": 4,
          "text": "Changi’s first Positive Energy Building"
        },
        {
          "level": 4,
          "text": "Singapore’s Largest Single-Site Rooftop Solar Project"
        },
        {
          "level": 4,
          "text": "Tackling emissions in the air and on the ground"
        },
        {
          "level": 4,
          "text": "Changi takes big steps to go green"
        },
        {
          "level": 4,
          "text": "Keeping Changi cool with less energy"
        },
        {
          "level": 4,
          "text": "Encouraging recycling in Changi Airport"
        },
        {
          "level": 4,
          "text": "Horticultural composting - Putting our waste to good use"
        },
        {
          "level": 4,
          "text": "Rotary waste drum"
        }
      ]
    },
    "content_hash": "c3a5bd3339528b7d8b1682e21ec43037"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/our-sustainability-efforts/social.html",
    "title": "Social",
    "content": "Social Social Discover how Changi Airport supports and gives back to the community. Changi Foundation Our Impact In Action Awards and Recognition Meet our Volunteers Features Our Vision and Approach Connecting with youths today, Empowering them for a better tomorrow. About Changi Foundation How we Make a Difference About Changi Foundation Changi Foundation is the philanthropic arm of Changi Airport Group. We are passionate about supporting disadvantaged youths. Guided by the vision of \"Connecting with youths today, Empowering them for a better tomorrow“, Changi Foundation aims to provide disadvantaged youths with opportunities to level up and to lay the groundwork for future successes. Our logo epitomises the stage of metamorphosis from a cocoon to a beautiful butterfly in a myriad of colours. Similarly, Changi Foundation hopes to aid in the metamorphoses of the lives of youths by unlocking their potential and helping their dreams take flight. We aspire to uplift disadvantaged youths in becoming future ready, and for them to join us as part of the Changi community. Changi Foundation is registered as a charity under the Charities Act and a Grantmaking Philanthropic Organisation (“Grantmaker”) with the Inland Revenue Authority of Singapore. Annual Report - Financial Year 2023/24 Annual Report - Financial Year 2022/23 Annual Report - Financial Year 2021/22 How we Make a Difference Changi Foundation's commitment to youth potential is mirrored in Changi Airport Group's confidence of its employees. Our purpose, Exceptional People, Connecting Lives inspires us to build a company where ordinary people achieve extraordinary results, positively impacting the communities we serve. We do this through: Advocating Active Volunteerism: We institutionalise giving by providing varied opportunities for employees and partners to give back to the community. We also put in place policies to encourage a robust culture of volunteerism and sustained giving. Building our one Changi culture: We believe in the collective impact of the Changi Airport community coming together to do good. We collaborate with airport partners to build a caring and inclusive airport community. Creating Deep Impact and Change: We co-develop programmes with partners to meet the needs of disadvantaged youths. We focus funding efforts on scaffolding, character building and transition-to-work programmes that increase youths’ employability. Annual Report - Financial Year 2023/24 Annual Report - Financial Year 2022/23 Annual Report - Financial Year 2021/22 Our Impact > 15,000 Youths Have benefited from Changi Foundation’s giving efforts since 2012. ~ 50 Airport Partners That we are working/have worked with as part of one Changi Community to give back. >$16 million in Grants That has been provided to character building, transition-to-work and scaffolding programmes since 2012. >25,000 Volunteer Hours Contributed towards doing good in the community since 2012. In Action Empowering youths with life-ready skills We worked with Metta School to organise independent living programmes (e.g. travelling on public transport, seeing a doctor) for special needs students to build up their social competence skills. Facilitating career development and work exposure experiences for youths We collaborated with our airport and community partners to provide career opportunities for youths in the airport. Keeping youths in School The CAG-Howe Yoon Chong Book Prize alleviates the financial burdens of lower-income youths and motivates recipients to do better academically. Awards and Recognition We are proud of the recognition received for our efforts. 14 Community Chest Volunteer Partner Award 2018, 2019, 2020, 2021, 2022, 2023, 2024 National Volunteer Philanthropy Centre Champion of Good Status 2017, 2018, 2020, 2022, 2024 HR Resources Online Excellence Award – CSR Strategy (Gold) 2019, 2024 Meet our M.A.D volunteers Hear from them on what it means to go M.A.D! (Make A Difference) Daniel Foo, Employee Volunteer The experience to give back was powerful and impactful. I am grateful to be in a company where I was given the opportunity to think out of the box and supported in the journey to do good. I hope to show what persons with disabilities can achieve when given the opportunity to prove themselves too. Nurhidayah Ishak, Employee Volunteer Giving without expectation is a wonderful gift to ourselves! Everybody is uniquely special in their own way. Jonathan Wong, Employee Volunteer Being able to contribute back to the society is something that I have always wanted to do. Changi Foundation gave me that opportunity. Am always happy to see the wonderful smiles on all the youths’ faces and that brings me joy. And through them, I have learnt to appreciate the simple things in life. Eng Wanyu, Employee Volunteer It has been an enlightening journey for me and my teammates on projects like bringing Metta on-board Sift & Pick and to bring students from Metta School for their Independent Travel Programme. As the saying goes, \"Diversity and Inclusion are about giving value to every human being, no matter our differences.\" Features Changi Journeys 2024 2023 2022 Collaborations with artists with special needs Collaborations bloom into record-breaking event for artists with special needs. January 2024 Find out more Cultivating Changi Airport Group’s heart for volunteering Growing a culture of volunteerism within Changi Airport Group through deep-dive partnerships. June 2024 Find out more Supporting aspirations of Art@Metta artists at Terminal 3 An artist with special needs gets a shot to living out her dream to be a retail assistant. March 2023 Find out more Changi Airport’s dedication to empowering youths for a brighter tomorrow Opening doors of opportunity and equipping young individuals with the skills and confidence they need to lead meaningful lives. September 2023 Find out more Textile collection with proceeds directed to Metta Welfare Association (MWA)’s Youth Employment Programmes Along with CAAS’ contribution, 900 kg was collected and passed on to MWA, who will direct resale proceeds to fund their Youth Employment programmes. February 2022 Find out more Grooming tech talents to strengthen in-house digital capabilities Hatch graduate joins Changi Airport Group’s UI/UX team. July 2022 Find out more Changi Foundation – Giving back never stops Curating job trials with our airport partners for Metta School students. September 2022 Find out more About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 7093,
    "word_count": 1069,
    "scraped_at": "2025-07-26T15:06:04.072817",
    "metadata": {
      "description": "Discover Changi Airport’s commitment in corporate philanthropy and our efforts in giving back to the community. ",
      "language": "en-SG",
      "headings": [
        {
          "level": 4,
          "text": "Community Chest"
        },
        {
          "level": 4,
          "text": "National Volunteer Philanthropy Centre"
        },
        {
          "level": 4,
          "text": "HR Resources Online"
        },
        {
          "level": 4,
          "text": "Collaborations with artists with special needs"
        },
        {
          "level": 4,
          "text": "Cultivating Changi Airport Group’s heart for volunteering"
        },
        {
          "level": 4,
          "text": "Supporting aspirations of Art@Metta artists at Terminal 3"
        },
        {
          "level": 4,
          "text": "Changi Airport’s dedication to empowering youths for a brighter tomorrow"
        },
        {
          "level": 4,
          "text": "Textile collection with proceeds directed to Metta Welfare Association (MWA)’s Youth Employment Programmes"
        },
        {
          "level": 4,
          "text": "Grooming tech talents to strengthen in-house digital capabilities"
        },
        {
          "level": 4,
          "text": "Changi Foundation – Giving back never stops"
        }
      ]
    },
    "content_hash": "4340d5919d576e530ef64fc109d7b6e1"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/partnering-us.html",
    "title": "Partnering Us",
    "content": "Partnering Us Partnering Us At Changi Airport, every business is built on trust and relationships. Advertising & Sponsorships Gain international exposure with our dynamic, high volume international audiences. Read more Airlines Grow with Singapore's ideal geographical location and liberal aviation policies. Read more Airport Concessions Find out more about the opportunities and support provided to our business partners. Read more Cargo Partners We are one of the busiest airports for air cargo, hangling over 1.8 million tonnes annually. Read more Changi e-Voucher(s) Unlock exclusive shopping and dining experiences with Changi e-Voucher(s). Redeem them across Changi Airport and Jewel for unforgettable moments. Read more Office & Warehouse Leasing Our Passenger Terminal Buildings and Airfreight Centre cater to all your business needs Read more Travel Trade We enable trade to grow your business Read more Procurement Looking to supply goods or services? See all our available tenders and quotations. Read more About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 1632,
    "word_count": 229,
    "scraped_at": "2025-07-26T15:06:06.621063",
    "metadata": {
      "description": "Collaborate with us. We provide an ideal business environment for our airline, freight and commercial partners to take on future challenges and opportunities.",
      "language": "en-SG",
      "headings": [
        {
          "level": 4,
          "text": "About Us"
        },
        {
          "level": 4,
          "text": "Sustainability"
        },
        {
          "level": 4,
          "text": "Partnering Us"
        },
        {
          "level": 4,
          "text": "Media Hub"
        },
        {
          "level": 4,
          "text": "Airport Community"
        },
        {
          "level": 4,
          "text": "Follow Us"
        }
      ]
    },
    "content_hash": "67311cbee76ba57b53080dc625b5358f"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/partnering-us/advertising-and-sponsorship.html",
    "title": "Advertising and Sponsorship",
    "content": "Advertising and Sponsorship Advertising and Sponsorships Reach out to international audiences on our prime platforms. Advertising Opportunities Sponsorship Opportunities Advertising Opportunities Changi Airport is a unique and unrivalled platform on which advertisers can reach a premium international audience. We offer exciting advertising opportunities at prime locations across all terminals, including award-winning landmarks, digital networks, and dynamic static sites. Take advantage of this exceptional advertising environment to showcase your brand at the world’s most awarded airport. Digital Network Featuring over 100 screens across the airport, these 86-inch digital screens are enabled with dynamic content capabilities, and allow brands to reach out to travellers at multiple touch points near points of sale and airline VIP lounges. Digital Chandelier The latest iconic media site at Changi Airport’s T2 Departure Hall – this pair of duo-facing, sleek Full HD LED displays will captivate and impress all check-in passengers at the terminal. Concourse Lightbox Network Spanning over 10 metres in total length, these highly visible lightboxes command the attention of departing and arriving passengers at high dwell time areas near boarding gates. Check-In Gallery Hanging LED Suspended prominently in the busy check-in area of Terminal 4, these 15sqm double-sided hanging LED screens are perfectly positioned to capture the attention of departing passengers, commanding a presence that ensures brand messages resonate at the initial touchpoint of the airport journey. For more information on advertising at Changi Airport, please visit JCDecaux’s website . Contact Us Advertising Enquiries Email: sales.sg@jcdecaux.com Sponsorship Opportunities Captivate the World Capture a dynamic audience of over 60 million passengers a year at Changi Airport with our extensive sponsorship opportunities. From sponsoring airport events and shopping promotions, to showcasing your esteemed products at our airport, you can ride on the rapid growth of travel retail in the region. Benefit from our premium business platforms to gain international exposure today. Contact Us Sponsorship Enquiries Email: enquiry@changiairport.com Other Links Contact Us Cargo Airport concessions Procurement Office and warehouse leasing About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 2933,
    "word_count": 403,
    "scraped_at": "2025-07-26T15:06:09.593800",
    "metadata": {
      "description": "Changi Airport offers extensive advertising and sponsorship opportunities at prime locations, through innovative media formats and unique platforms.",
      "language": "en-SG",
      "headings": [
        {
          "level": 4,
          "text": "About Us"
        },
        {
          "level": 4,
          "text": "Sustainability"
        },
        {
          "level": 4,
          "text": "Partnering Us"
        },
        {
          "level": 4,
          "text": "Media Hub"
        },
        {
          "level": 4,
          "text": "Airport Community"
        },
        {
          "level": 4,
          "text": "Follow Us"
        }
      ]
    },
    "content_hash": "1735c4538e78f958c5cff2132bab72d6"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/partnering-us/airlines.html",
    "title": "Airlines",
    "content": "Airlines Airline Partnerships Grow with Singapore’s ideal geographical location and liberal aviation policies. See the Potential Partner Us See the Potential A Dynamic Regional Hub As Asia Pacific's leading air hub, serving a catchment population of 10 million within a 2-hour radius, we are well-positioned to help your airline capitalise on the region's growing demand for air travel. With nearly 100 partner airlines flying to some 150 cities in about 50 countries and territories worldwide, Singapore offers strong connectivity to the Southwest Pacific and Southeast Asia. See our traffic statistics A Bustling Airport Changi has built an unrivalled world-class experience, bringing smiles to the millions of travellers who pass through our airport. Having won more than 600 prestigious awards and accolades for our achievements in customer satisfaction, cost efficiency and service level, your guests will be well taken care of. To grow alongside you, we are consistently enhancing our airport infrastructure and creating innovative services to deliver an exceptional experience for both our partners and travellers. A Vibrant Business Destination Singapore is one of Asia's most dynamic and cosmopolitan economies, built on a strong rule of law and financial infrastructure that attracts businesses globally. With its robust government policies, Singapore is one of the top three easiest places in the world to do business (Doing Business 2019 Report, World Bank). Additionally, Singapore is also consistently rank highly for investment potential, according to Business Environment Risk Intelligence, a US-based research institute. A Strong Partnership At Changi Airport Group, success begins with strong partnerships. With close to 100 airlines operating out of our airport, including those represented in major alliances such as oneworld, Star Alliance and SkyTeam, you will have many opportunities for collaboration with other airlines partners here at Changi. Changi Airport offers various incentive schemes to drive passenger traffic and support your airline's network and capacity. A dedicated team at Changi studies trends and aviation industry opportunities to identify growth and marketing opportunities for airline partners. Hear what others say Our success in Singapore is deeply rooted in the amazing support from Changi Airport Group (CAG). They’ve turned challenges into triumphs for Ethiopian Airlines Singapore, and we’re beyond grateful. Together, we’re working to make Singapore a vibrant hub for Africans. As PM Lawrence Wong said, CAG’s dream of an International Air Hub shines brighter with Ethiopian Airlines. Even amid inflation and fierce competition, we are excited and confident in our future togetherness, knowing this partnership is built on mutual dedication and trust. Regional Manager, Ethiopian Airlines Since China Eastern Airlines established its branch in Singapore in 1994, our partnership with Changi Airport Group (CAG) has been a cornerstone of our success in the Singapore market for the last 30 years. With CAG's support and collaboration, we have significantly expanded our operations, becoming a key player in the China-Singapore civil aviation market. We are deeply grateful for the continued care and assistance provided by CAG over the years and are confident in the future of our cooperation. We look forward to further deepening our partnership, continuing to contribute to the economic, trade, and cultural exchanges between China and Singapore. General Manager, China Eastern Airlines It is my pleasure to appreciate and thank Changi Airport Group (CAG) for their unstinted support to foster over 70 years of relationship with Air India. Our past collaboration with CAG on operational and marketing fronts leveraged on both parties’ strengths to elevate travel experiences of customers across the region. The proactive and supportive approach of the CAG towards airlines highlights how airports and airlines can work together to achieve a mutually enriching relationship, encouraging growth in air travel while ensuring high service standards. We look forward to an ever-lasting relationship between Air India and the CAG which grows from strength to strength and help aviation, in general, spread wings to soar high. Regional Manager, Air India Partner Us At Changi Airport, we recognize the essential role your airline plays in enhancing our status as a premier air hub. We invite you to explore mutually beneficial partnerships with us, whether for passenger or cargo operations to and from Singapore. In a dynamic aviation landscape, we are dedicated to helping you capitalize on emerging opportunities and navigate challenges effectively. Partner with us and experience a supportive environment where you’ll always feel at home. Contact us Other Links Cargo Travel Trade Airport concessions Office and warehouse leasing About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 5494,
    "word_count": 808,
    "scraped_at": "2025-07-26T15:06:11.788188",
    "metadata": {
      "description": "Partner with us to leverage Singapore’s ideal geographical location and liberal aviation policies, and thrive in a conducive environment for growth.",
      "language": "en-SG",
      "headings": [
        {
          "level": 4,
          "text": "Regional Manager, Ethiopian Airlines"
        },
        {
          "level": 4,
          "text": "General Manager, China Eastern Airlines"
        },
        {
          "level": 4,
          "text": "Regional Manager, Air India"
        },
        {
          "level": 4,
          "text": "About Us"
        },
        {
          "level": 4,
          "text": "Sustainability"
        },
        {
          "level": 4,
          "text": "Partnering Us"
        },
        {
          "level": 4,
          "text": "Media Hub"
        },
        {
          "level": 4,
          "text": "Airport Community"
        },
        {
          "level": 4,
          "text": "Follow Us"
        }
      ]
    },
    "content_hash": "10b475cc34b300df63acfd0c1832c532"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/partnering-us/airport-concessions.html",
    "title": "Airport Concessions",
    "content": "Airport Concessions Airport Concessions Our guaranteed support, international popularity and excellent infrastructure are just some reasons why your business will thrive at Changi. More than an Airport Airport Retail Concession Spaces Short-Term Leases Partner with Us Tenant Resources More than an Airport Airport Retail We ensure that we provide active support to tenants by through various strategic means. Revolutionising Retail Creating a fresh retail experience for every traveller. Marketing & Promotions Our programmes maximise the retail potential for your brand. Engaging Platforms E-commerce and loyalty programmes create exceptional value. Unwavering Support Not just top of game, but top of mind for customers. Concession Spaces The shopping and dining spaces at Singapore Changi Airport are divided into two main areas across all terminals- Airside and Landside. Airside refers to the area past immigration clearance and is accessible to all travellers and transit passengers. Landside, on the other hand, are areas before immigration clearance and are accessible to travellers, transit passengers with relevant visa requirements, and all members of the public. T1 T2 T3 T4 Terminal 1 Known fondly as the \"Grande Dame\" of Changi Airport, Terminal 1 was recently rejuvenated in 2012. About 22,000m 2 have been added to Terminal 1, bringing the total floor space to about 308,000m 2 . Spatial comfort, better passenger flows, and more facilities are brought about with the larger floor area. Once you step into the airport, art installations such as the Kinetic rain and the Lantern Feature wall depict the joy of travelling, and greatly adds to the mood and ambience. Terminal 1 Airside A wide thoroughfare in Terminal 1 provides greater visibility and awareness for shops, breathing new life into your retail space. With so many things to see, do and shop in the transit area, passengers will never feel bored at Changi Airport. With a consistently high footfall, providing a quality passenger experience synonymous to the Changi experience is paramount for your business. Developed along the theme of \"Tropical City\", the upgraded Terminal 1 also features higher ceilings, improved lighting and thoughtful landscaping. Terminal 1 Landside With an inviting atmosphere, travellers and locals looking to relax and dine in comfort by spending their time in the airport need to look no further. The Arrival Hall, and Level 3 above the Departure Hall in the public area features a wide array of Dine-in restaurants, cafes, and fast-food spaces. F&B businesses looking to gain international recognition by expanding your footprint into Changi Airport will find Terminal 1 the perfect fit. View leasing opportunities Terminal 2 Opened in 1991, Terminal 2 has a wealth of shopping outlets and dining options that appeals to a wide spectrum of visitors. Looking to tap into a diversified and cosmopolitan customer pool? As the busiest terminal in Changi Airport, Terminal 2 will be able to bring you to your target audience. Terminal 2 Airside With more than 70 retail outlets and more than 25 F&B outlets in the transit area, there is something for everyone. Shopping and dining areas are seamlessly integrated with the terminal’s lush greenery and relaxation areas. With a terraced multi-level ceiling that allows natural light to filter in, travellers bask in a cosy and tranquil ambience - allowing them to shop in comfort and style. A steady stream of footfall is guaranteed with fluid passenger movement throughout all thoroughfares. Terminal 2 Landside In the public areas, lighting panels above the check-in rows are designed in the shape of palm leaves, creating the feeling of tropical lushness and comfort. Boasting more than 20 retail, service and 20 F&B outlet spaces in the public area, brands and operators can look forward to targeting both travellers and locals alike. Terminal 2 remains as the top choice for businesses wanting to have a presence in Changi Airport. View Leasing Opportunities Terminal 3 Opened in 2008, Changi Airport's eco-friendly 'green terminal' lifts spirits with natural skylight and gardens featuring over 200 species of foliage and butterflies. Boasting a well thought-out avant-garde design, Terminal 3 is hailed as a mall within a terminal. Terminal 3 is truly a multi-dimensional shopping paradise with the largest number of retail, service and F&B spaces. Terminal 3 Airside In Terminal 3, Changi Airport introduced a first single-street transit retail concept. Set amongst lush green surroundings with an organic, ‘wave’ layout of the retail outlets, it provides unobstructed views for maximum visibility and exposure for your brand. Terminal 3 Landside Terminal 3 is the only terminal with a dedicated shopping zone on basement 2. Found in the public area, it features over 50 retail, service and F&B outlets. A family-friendly destination, interactive children's facilities such as playgrounds and the slide@T3 - the world’s tallest slide in an airport, are music to children's ears. Established anchor tenants such as Kopitiam and Fairprice Finest are well-complemented with a wide variety of fashion outlets and kid-centric concessions, offering the family a fun day out at the airport. On the other levels, there exists a wide variety of F&B options. Two anchor tenants - The Planet Traveller and MindChamps PreSchool at Level 3 are perched on top of the transit mall, giving patrons a unique perspective of the airside transit area in Terminal 3. Linked to the viewing gallery, vsitors can enjoy a magnificient view of planes taking off whilst taking a breather from shopping, or after a delicious meal. Exciting event outposts are often held at the airport to spice up the shopping and dining experience at Changi Airport. Over the years, visitors have been delighted with showcases including the \"F1 Rev Up Singapore!\" Roadshow and the Chinese New Year Bazaar at Basement 2, a strategic location right across the bustling Kopitiam Food Court. View Leasing Opportunities Terminal 4 At the new Terminal 4, the modern traveller instantly feels at home. Marked by a distinct boutique presence, filled with natural light and armed with innovative details, the iconic T4 instinctively addresses the shifting preferences of the future traveler. Passengers enjoy 17,000m2 of shopping and dining options. Far from an ordinary port of call, every inch of T4 is crafted to surprise and delight, opening into a new era of modern travel. We invite you to be a part of it. Terminal 4 Airside Wide spaces filled with natural light, with trees lining the main shopping boulevard, Terminal 4 is designed for the modern traveller in mind. Passengers will have access to shops right until the moment that they board their flights. Shop spaces are designed with unique shop fronts, high ceilings and double-volume facades, giving tenants a canvas for visually impactful designs that can fully express each brand's unique qualities. Terminal 4 Landside Anywhere they choose, diners are immersed in the airport’s lively surroundings. From the foodcourt, they enjoy a view of the comings and goings on the airport runway. Restaurants on Level 2 Mezzanine offer a bird’s eye view of the Departure Check-In Hall. Along the Central Galleria, café-hoppers can savour a relaxing cuppa amidst the hustle and bustle of the Departure Transit Lounge. View Leasing Opportunities Short-term Leases of Event Space The following are some examples of past events that have been held at Changi Airport. For more enquiries, please reach out to us here . You can also sign up for our mailing list to be kept informed of any upcoming leasing opportunities here . Enquire now Partner with us Airside Concessions Form Landside Concessions Form Open Leases Short-term Leases Form Tenant Resources This is a self-service guide with useful resources and links to aid you along your tenant onboarding journey onto Changi Airport's ecosystem​. One Calendar Submission of Work Permit, access to Renovation Guide, forms and templates​. Find out more ONE Changi App QSM training and communication platform for the Changi Airport Community.​ Find out more Access Control & Scheduling System Management and booking of vehicle access to basement Loading/ Unloading Bay. Find out more Airport Pass Application Application of Airport Pass for access to restricted areas. Find out more Salesforce Commercial QSM Incentive Programme staff declaration and viewing of feedback. Find out more Lease Management System Submission of POS installation and removal​ request and Monthly Sales Declaration. Find out more Changi Rewards Tenant Portal Submission of Changi Rewards eVouchers claims. Find out more E-Invoicing (Web*EPIC) Retrieval of invoices, credit notes and statement of accounts. Find out more SESAMi Changi Airport Group's online portal for e-Sourcing and e-Invoicing transactions. Find out more Other Links Business Expertise Airport Retail Partnering Opportunities Contact Information About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 9611,
    "word_count": 1487,
    "scraped_at": "2025-07-26T15:06:14.778046",
    "metadata": {
      "description": "Find out why your business will thrive with our guaranteed support, international popularity, excellent infrastructure, trademark comfort and efficiency.",
      "language": "en-SG",
      "headings": [
        {
          "level": 3,
          "text": "Terminal 1 Airside"
        },
        {
          "level": 3,
          "text": "Terminal 1 Landside"
        },
        {
          "level": 3,
          "text": "Terminal 2 Airside"
        },
        {
          "level": 3,
          "text": "Terminal 2 Landside"
        },
        {
          "level": 3,
          "text": "Terminal 3 Airside"
        },
        {
          "level": 3,
          "text": "Terminal 3 Landside"
        },
        {
          "level": 3,
          "text": "Terminal 4 Airside"
        },
        {
          "level": 3,
          "text": "Terminal 4 Landside"
        },
        {
          "level": 4,
          "text": "Revolutionising Retail"
        },
        {
          "level": 4,
          "text": "Marketing & Promotions"
        }
      ]
    },
    "content_hash": "e05d3a69b03543b3199b7e47a8905033"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/partnering-us/cargo-partners.html",
    "title": "Cargo Partners",
    "content": "Cargo Partners Cargo Partners As one of the world’s busiest airports for international air cargo, the Singapore Changi Air Cargo Hub will take your business further. A LEADING AIR CARGO HUB Delivering Air Cargo Excellence, Connecting You Globally With Reliable Speed Learn about how Changi Airport meets the logistical demands of your business and how you can grow where there are no limits today. Air Traffic Statistics Learn about how Changi Airport has performed as one of the largest international air cargo hubs in the world. Our Pharmaceutical Air Cargo Expertise Learn about our initiatives to enhance our capabilities in pharmaceutical transportation. Taking Your Business Further Learn more about the Singapore Changi Air Cargo Hub by downloading our marketing brochure today. Why Partner Us? Operational Excellence NETWORK AND CONNECTIVITY SPECIAL CARGO HANDLING CAPABILITIES FUTURE CAPACITY DEVELOPMENT SINGAPORE’S LOGISTICS COMPETITIVENESS Singapore is ranked top globally for its logistics capability and cargo performance, elevating customers' trust through air cargo excellence. Logistics Performance Index (By The World Bank) Based on the 2023 Logistics Performance Index (LPI), Singapore is ranked 1st, with an LPI score of 4.3. DHL Global Connectedness Index Singapore is one of the world’s most connected countries, topping DHL’s Global Connectedness Index in 2024. CHANGI’S WIDE AND SEAMLESS CONNECTIVITY Singapore Changi has developed one of the widest networks in Asia and boasts an equally extensive network to other parts of the world, connecting customers to global markets with reliable speed. Our International Air Cargo Connectivity 120 airlines, 420 cities, 115 countries (including both physical and codeshare links) With more than 6,900 weekly scheduled flights, an aircraft takes off or lands at Changi roughly once every 90 seconds More than 25 cargo airlines operating close to 500 weekly cargo flights to over 50 cargo city links Connects key markets in Asia Pacific within 7-hour flight time Regional airlines offering coverage and interline opportunities to emerging Southeast Asian and South Asian markets Data as of March 2024 Read more Our Family of Cargo Airlines Cargo Airlines Aerologic Cathay Pacific Airways K-Mile Air SF Airlines Air Hong Kong China Airlines Korean Air Shandong Airlines Air Incheon China Cargo Airlines My Indo Airlines Sichuan Airlines All Nippon Airways Emirates Nippon Cargo Airlines Silk Way West Airlines Asia Cargo Airlines EVA Airways Polar Air Cargo Singapore Airlines Asiana Airlines FedEx Express Qatar Airways Tasman Cargo Airlines Cargolux Airlines Hong Kong Air Cargo Raya Airways United Parcel Service Our Seamless Multimodal Connectivity Air. Sea. Road. We’ve got you covered. Dense sea and road networks for multimodal transhipment Seamless intermodal connectivity between one of the world’s busiest seaports and airports A short drive from PSA terminals—the world’s second largest container port and busiest transhipment hub with connectivity to over 600 ports Regional cross-border trucking networks 9 berths operational at Tuas Mega Port as of August 2024 An Integrated Logistics Gateway Designed to move cargo like clockwork, round the clock, all top 25 of the world’s largest airfreight forwarders have established major operations in Singapore. ASIA AWOT Global Logistics Group CTS International Logistics Dimerco Express Group Kerry Logistics Kintetsu World Express Nippon Express NNR Global Logistics Sinotrans Yusen Logistics EUROPE Bolloré Logistics cargo-partner CEVA Logistics DACHSER DB Schenker DHL Global Forwarding DSV GEODIS Hellmann Worldwide Logistics Kuehne + Nagel Maersk Logistics USA C.H. Robinson Crane Worldwide Logistics Expeditors FedEx Logistics UPS Supply Chain Solutions Source: 2023 Armstrong & Associates, Inc. CHANGI’S EFFICIENT CARGO FACILITIES, INFRASTRUCTURE, AND HANDLING CAPABILITIES From temperature-sensitive pharmaceuticals to time-sensitive e-commerce parcels, Changi can do it all. Within a 24/7 Free Trade Zone, Changi has dedicated bays to accommodate the largest freighter planes and state-of-the-art facilities to handle the most unique types of cargo. CHANGI AIRFREIGHT CENTRE / ALPS Cold-Chain Logistics E-Commerce EXPRESS CHANGI AIRFREIGHT CENTRE / AIRPORT LOGISTICS PARK OF SINGAPORE With over 70 hectares of contiguous Free Trade Zone and over 350,000 sqm of warehouse capacity, Changi Airfreight Centre and Airport Logistics Park of Singapore offer shippers and third-party logistics companies a unique opportunity to establish Regional Distribution Centers or Regional Fulfilment Centers, while reducing handling costs and cycle time. Changi Airfreight Centre (CAC) With airfreight operations consolidated here, a 24-hour Free Trade Zone allows transshipment cargo to be broken down and reconsolidated with minimal customs formalities. Airport Logistics Park of Singapore (ALPS) With over 26 hectares of total land space, global shipping and third-party logistics companies gain unique opportunities to establish Regional Distribution Centres within the airport Free Trade Zone. HANDLING PHARMACEUTICALS WITH DELICATE CARE Your pharmaceutical shipments will be transported with the highest standards through Changi – thanks to the trusted capabilities of the first and largest IATA Certificate of Excellence for Independent Validators in Pharmaceutical Logistics (CEIV Pharma) certified community in Asia Pacific. Together, Changi Airport offers: Temperature-controlled environment throughout the airport cool chain Over 375,000 tonnes of annual cool chain handling capacity (by cargo handlers) with state-of-the-art temperature-controlled infrastructure & equipment Trained and experienced cool chain specialists Unparalleled air connectivity and multi-modal solutions SATS Coolport SATS Coolport is Asia’s first on-airport perishable handling facility dedicated to ensuring cold-chain integrity for a wide range of delicate cargo, including pharmaceuticals. With a well-trained team, quality management system and state of-the-art facility that adheres to Good Distribution Practice guidelines, SATS is proud to be certified by IATA as the world’s first CEIV in Pharmaceutical Handling in 2014. First facility in the world to be awarded the IATA CEIV Pharma certification since 2014 8000 sqm on-airport facility, with more than 2000 sqm of column-free warehouse space 18 cold rooms of adjustable temperature zones from -20℃ to +25℃, with product segregation capability 250,000 tonnes annual handling capacity Multi-level unit load device storage with up to 250 airline pallet positions catered for different temperature zones More than 40 on-site charging points for active containers as well as sea reefers Includes on-tarmac cool dolly with the following key features: Internal temperature range of -20℃ to 20℃ Fast charging to -20℃ within 2 hours Able to last more than 10 hours of continuous operations on a full charge 15 temperature-controlled truck docks Able to handle pharmaceutical and biomedical products, fresh cut flowers, meats, food, and others Certifications include IATA CEIV Pharma certification, HSA Good Distribution Practice (GDP), TAPA, and others dnata Coolchain Built in 2013, dnata Coolchain is designed to handle high-value, high-yield perishable items and pharmaceuticals within a dedicated, state-of-the-art cargo handling facility. Encompassing the latest cold storage technologies and designs, it offers solutions and cold chain products for a wide range of temperature-sensitive cargo. dnata has been certified by IATA for CEIV in Pharmaceutical Handling at Singapore. 1,400 sqm temperature-controlled facility with annual handling capacity of 75,000 tonnes (with flexibility to scale) Delivery within Changi Cargo Complex using cool dollies to support an unbroken cool chain for time and temperature-sensitive shipments Temperature controls in individual rooms ranging from freezing -25˚C or cold room conditions of 0˚C to 25˚C Web-based monitoring system to facilitate real-time management 14 modular cold storage areas for loose/pallet cargo, each with its dedicated climate control capability Individual room space ranging from 26 sqm to 42 sqm for customised temperature controlled storage 23 LD7 container holding positions and 165 EU pallet holding positions for loose cargo 784 sqm of temperature-controlled break-and-build area 16 charging stations for Envirotainers and CSafe units and top-up service for dry ice 2 charging stations at truck docks for shipping containers, reefers Stuffing/unstuffing of shipping containers for air-sea shipments Direct from shipper services including conditioning of active containers, labelling, loading, sealing and recording of all shipment milestones Pharma@Changi In 2017, Changi established the Pharma@Changi Initiative, the first and largest community in Asia Pacific, among our CEIV Pharma certified community to pursue best practices in air pharma transportation and assessing emerging trends and technologies. We continue to grow and expand our community to enhance the hub’s pharmaceutical handling capabilities. Pharma.Aero Changi Airport is part of Pharma.Aero, an international association consisting of Pharma shippers, CEIV certified cargo communities, airport operators and other air cargo industry stakeholders to achieve excellence in reliable end-to-end air transportation of pharmaceutical shipments. Its mission is to foster collaboration between CEIV certified airport communities dedicated in developing and leading when it comes to handling pharmaceuticals. IATA CEIV Pharma What is IATA CEIV Pharma? While Good Distribution Practice (GDP) helps raise standards, the IATA CEIV Pharma program is a “GDP+” certification given it encompasses GDPs from around the world, international standards such. asWHO Annex 5 and IATA Chapter 17 and national or local regulations as applicable. This ensures excellence in the transportation and handling of pharmaceutical products while at the same time addressing specific air cargo needs. E-COMMERCE Southeast Asia’s e-commerce market has been forecasted to grow at a CAGR of over 20%, tripling its size today to US$230 billion in gross merchandise volume by 2026. Equipped with efficient, purpose-fit, and smart sorting and processing capabilities, Changi Airfreight Centre enables operators to connect international e-commerce cargo at speed for faster delivery and improved traceability. SATS eCommerce AirHub In April 2017, SATS unveiled a S$21 million eCommerce AirHub. The 6,000m2 facility houses state-of-the-art innovations and technology aimed at improving productivity. A fully automated mail sorting system increases the mailbag process capacity of SATS to more than 1,800 an hour. A direct integration with SingPost’s airmail consignment operations and the facility’s location within the Free Trade Zone on the airside reduces turnaround time by 50 percent from six to three hours. This enables international e-commerce mail to connect to earlier flights for faster delivery. SingPost Airmail Transit Center Singpost has established operations in the Airmail Transit Center (ATC) in Changi Airfreight Centre (CAC) where it houses security screenings of mail imports into Singapore and processing of Express Mail Service (EMS), air parcels and registered mails. The four-storey ATC building also contains the processing of open transit (mixed transhipment) and closed transit (intact mailbags), where SingPost would cut CN38 documents for the transhipped mail. EXPRESS Changi Airport is home to major express players—DHL Express, FedEx Express, UPS, and SF Express. With all major players operating regional hubs in Singapore, businesses and consumers have abundant choices to transport their goods and documents quickly, reliably, and predictably to and from destinations across Asia Pacific and the world. By opting for time-definite services, shipments can reach major cities in Asia Pacific, Europe, and the Americas by the morning of the next working day. DHL South Asia Hub S$140 million facility in Changi Airfreight Centre Operational since 2016 Floor area of over 23,500 sqm 1 of 4 strategic hubs in Asia Pacific region, serving mainly the Southeast Asia and Australasia sub-regions Upgraded automated express parcel sorting and processing system in June 2024, increasing handling capacity by 35% to over 14,000 shipments per hour and over 630 tonnes of cargo per day Over 120 weekly flights in and out of Singapore on JV partners and commercial airline partners Partnership with Singapore Airlines since March 2022 to strengthen US-Asia trade through 5x B777 freighters, which bring 1,224 tonnes of weekly transpacific capacity through Singapore FedEx Express South Pacific Regional Hub Over 26,000 sqm integrated facility, operational since 2012 S$97 million facility that houses air, ground, and clearance operations under one roof Consolidation point for transshipments into and out of Australia, New Zealand, and Southeast Asia 2 adjacent freighter parking stands More than 50 weekly FedEx flights in and out of Singapore Fully automated, high-speed sorting system that can sort up to 12,000 packages per hour Accommodates 280 delivery vehicles Singapore is also home to FedEx Express’ Asia Pacific, Middle East & Africa’s regional headquarters since February 2024 UPS Hub and Gateway Facility and UPS Distribution and Logistics Hub (in ALPS) Establishing operations in Singapore since 1988, UPS has chosen Singapore to be home to its Asia Pacific Regional Headquarters Over 10 weekly UPS flights in and out of Singapore Expanded its Hub and Gateway facility by 800 sqm in March 2023 to cater to growth in volumes with new sortation line, raising handling capacity by 40% to reach 55,000 tonnes per year Located in Airport Logistics Park of Singapore and standing at almost 400,000 sqft, UPS' Distribution and Logistics Hub is 1 of 6 UPS facilities in Singapore SF Express Gateway Established in March 2010, SF Express Singapore serves customers from its full-service Distribution Centre, Service Hubs, and Country Office Over 190 staff and over 190 vehicles 6 self-operated service stations 2 distribution hubs 2 auto-sorting systems 7 flights a week using B767 aircraft CHANGI EAST INDUSTRIAL ZONE Changi East Industrial Zone (CEIZ) is a dedicated airport industry zone set aside within the Changi East airport development to provide infrastructure for the longer-term development of air cargo, maintenance, repair & overhaul activities (MRO), aviation support facilities, and fuel farm at Changi Airport. CEIZ is slated to be operation by mid 2030s. Together with the revamped Changi Airfreight Centre (CAC), both CAC and CEIZ would make up Changi’s future air cargo hub spanning over 150 hectares of land. The total annual handling capacity will also increase from the current 3 million tonnes per annum to 5.4 million tonnes per annum. Both sites will be under the same contiguous Free Trade Zone area, with airside access. PARTNER US To find out more: Read about our events and activities here Contact us here Download Marketing Brochure Other links Airlines Travel trade Office and warehouse leasing About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 15818,
    "word_count": 2295,
    "scraped_at": "2025-07-26T15:06:16.730926",
    "metadata": {
      "description": "Recognised for our extensive connectivity, high level of service quality, and operational efficiency, the Changi Air Cargo Hub is among the top in the world.",
      "language": "en-SG",
      "headings": [
        {
          "level": 2,
          "text": "CHANGI AIRFREIGHT CENTRE / AIRPORT LOGISTICS PARK OF SINGAPORE"
        },
        {
          "level": 2,
          "text": "HANDLING PHARMACEUTICALS WITH DELICATE CARE"
        },
        {
          "level": 2,
          "text": "E-COMMERCE"
        },
        {
          "level": 2,
          "text": "EXPRESS"
        },
        {
          "level": 3,
          "text": "Our Family of Cargo Airlines"
        },
        {
          "level": 3,
          "text": "An Integrated Logistics Gateway"
        },
        {
          "level": 3,
          "text": "SATS Coolport"
        },
        {
          "level": 3,
          "text": "dnata Coolchain"
        },
        {
          "level": 3,
          "text": "dnata Coolchain"
        },
        {
          "level": 3,
          "text": "Pharma@Changi"
        }
      ]
    },
    "content_hash": "82c0dba6cde89ee7c7f2a7a40dcf9d2a"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/partnering-us/office-and-warehouse-leasing.html",
    "title": "Office And Warehouse Leasing",
    "content": "Office And Warehouse Leasing OFFICE AND WAREHOUSE LEASING Our well-equipped facilities will serve all your business needs. OFFICE AND WAREHOUSE LEASING PASSENGER TERMINAL BUILDINGS (PTB) Changi Airport houses over 700 office units across the Passenger Terminal Buildings. Whether you are seeking prime locations in passenger terminals or more secluded spots at the finger piers, we have offices that can meet your business needs. Ample space, excellent public transportation links, and amenities such as retail shops, F&B outlets, medical centres and ATMs across all terminals, keep things convenient for you and your employees. CHANGI AIRFREIGHT CENTRE (CAC) Air freight operations at Changi Airport are located within the 47-hectare CAC, which operates around the clock. The four Cargo Agent Buildings (CAB) – C, D, E, and Megaplex – are located in the CAC, and house over 125,000sqm of office and warehouse space. With these facilities, operators can run cargo-related activities in close proximity to the airfreight terminals located within the CAC. Partner Us Please contact Changi Airport Group directly to find out more about how our Passenger Terminal Buildings and Changi Airfreight Centre can cater to your evolving business needs. Explore our range of other partnership options, such as airport concessions, airport cargo, and more. Contact Us Other Links Airlines Cargo Airport Concession Procurement Advertising and Sponsorship About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 2054,
    "word_count": 295,
    "scraped_at": "2025-07-26T15:06:20.078225",
    "metadata": {
      "description": "Explore leasing terms for office and warehouse spaces at Changi Airport, suitable for businesses in logistics and aviation. Schedule a site visit today.",
      "keywords": "office space airport, airport office space",
      "language": "en-SG",
      "headings": [
        {
          "level": 4,
          "text": "About Us"
        },
        {
          "level": 4,
          "text": "Sustainability"
        },
        {
          "level": 4,
          "text": "Partnering Us"
        },
        {
          "level": 4,
          "text": "Media Hub"
        },
        {
          "level": 4,
          "text": "Airport Community"
        },
        {
          "level": 4,
          "text": "Follow Us"
        }
      ]
    },
    "content_hash": "c12fd3c7562e062dc541db7a06110cfe"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/partnering-us/travel-trade.html",
    "title": "Travel Trade",
    "content": "Travel Trade Travel Trade We support travel trade partners in growing their businesses through Changi Airport by facilitating connections and fostering growth. CHANGI TRAVEL CIRCLE Changi Airport B2B programme for the travel trade designed to connect travel trade partners worldwide with everything related to Changi Airport. Enabling Our Travel Trade Partners Join us to spark new ideas, enhance your customers' experience as they travel to or through Changi, and foster business growth. Membership is free and exclusively for the travel trade. Find out more Members Privileges Early and exclusive access to deals and experiences​ Be one of the first to know of new experiences and deals at Changi and tailor them to suit your customers' needs. Find out more Insider marketing resources Check out a myriad of useful toolkits, product brochures and visuals for your marketing needs. Find out more Networking opportunities​ Get connected with Singapore travel trade partners and identify new business opportunities. Find out more Gateway to pre-book experiences Pre-book and guarantee a slot before your customer’s arrival.​ Find out more Other Links Airlines Cargo Airport concessions Office and warehouse leasing About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 1827,
    "word_count": 263,
    "scraped_at": "2025-07-26T15:06:21.521077",
    "metadata": {
      "description": "We support travel trade partners in growing their businesses through Changi Airport by facilitating connections and fostering growth.",
      "language": "en-SG",
      "headings": [
        {
          "level": 4,
          "text": "Early and exclusive access to deals and experiences​"
        },
        {
          "level": 4,
          "text": "Insider marketing resources"
        },
        {
          "level": 4,
          "text": "Networking opportunities​"
        },
        {
          "level": 4,
          "text": "Gateway to pre-book experiences"
        },
        {
          "level": 4,
          "text": "About Us"
        },
        {
          "level": 4,
          "text": "Sustainability"
        },
        {
          "level": 4,
          "text": "Partnering Us"
        },
        {
          "level": 4,
          "text": "Media Hub"
        },
        {
          "level": 4,
          "text": "Airport Community"
        },
        {
          "level": 4,
          "text": "Follow Us"
        }
      ]
    },
    "content_hash": "0720ae96a822c5b892e05041a258dacd"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/partnering-us/procurement.html",
    "title": "Procurement",
    "content": "Procurement Procurement Explore opportunities to supply goods or services to Changi Airport. PROCUREMENT OPPORTUNITIES A supplier of goods or services? Explore business opportunities with Changi Airport through our online portal. All interested parties will need to be registered on our online portal. Log in / Register here Should you require any clarification or assistance on Changi eProcure, please refer to this Supplier User Guide . You may also email customercare@sesami.com or call (+65) 6302 5317 for assistance. Quick Links Supplier Code of Conduct Conditions of Contract OTHER LINKS Cargo Airport Concessions Airlines Office and Warehouse Leasing About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 1271,
    "word_count": 176,
    "scraped_at": "2025-07-26T15:06:24.590559",
    "metadata": {
      "description": "Discover business opportunities at Changi Airport. Register on our eProcure portal to supply goods and services and grow your business.",
      "language": "en-SG",
      "headings": [
        {
          "level": 4,
          "text": "Supplier Code of Conduct"
        },
        {
          "level": 4,
          "text": "Conditions of Contract"
        },
        {
          "level": 4,
          "text": "About Us"
        },
        {
          "level": 4,
          "text": "Sustainability"
        },
        {
          "level": 4,
          "text": "Partnering Us"
        },
        {
          "level": 4,
          "text": "Media Hub"
        },
        {
          "level": 4,
          "text": "Airport Community"
        },
        {
          "level": 4,
          "text": "Follow Us"
        }
      ]
    },
    "content_hash": "1e7f8b7f64e3a7c45ee13eab4b737859"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/partnering-us/contact-information.html",
    "title": "Contact Information",
    "content": "Contact Information Contact Information Can't find what you're looking for? Don't hesitate to get in touch with us. Changi Airport Office Media Contact Career Opportunities Advertising Opportunities On Fraud and Misconduct Office & Warehouse Leasing short-term leasing GETTING TO CORPORATE RECEPTION The Changi Airport Group Corporate Reception is located at Changi Airport Terminal 2, Level 4. To reach our Corporate Reception, please take lift number 8 or 9 located in the CAG Corporate Entrance at Terminal 2, Departure Check-in Hall South, Level 2 (near Check-in Row 12). Office hours are as follows: Monday to Thursday: 8:30am to 1:00pm; 2:00pm to 6:00pm Friday: 8:30am to 1:00pm; 2:00pm to 5:30pm Need to contact others at CAG? Customer Centre Want to speak with someone from our Customer Contact Centre? Do reach out to us if you have enquiries pertaining to flights, airlines, lost & found and other customer enquiries. Get in Touch CAI Want to speak with someone from Changi Airports International (CAI)? Do reach out to us if you have enquiries pertaining to consulting and investment services. Get in Touch FOR MEDIA-RELATED ENQUIRIES: Changi Airport Group, duty media relations team Tel: +65 8608 3522 Email: cmc@changiairport.com This number is only for calls from journalists/ reporters. We regret that we will not be able to help with enquiries from members of the public. For the customer hotline of Changi Airport and Jewel, click here . SPOKESPERSON FOR CAG Spokesperson for Changi Airport and Changi Airport Group Ivan Tan Group Senior Vice President, Corporate & Marketing Communications CAREERS IN CHANGI AIRPORT GROUP Start exploring career opportunities with Changi View Career Opportunities CAREERS IN THE CHANGI AIRPORT COMMUNITY From providing best-in-class passenger or baggage services, to ensuring the safety and security of the airport, you’ll never be bored being part of the community in Changi. Find out more about working with our trusted partners. Certis At Changi, the Certis Group provides security solutions, such as access control, anti-touting and screening of passengers and baggage—delivering results without compromising passenger satisfaction. Find Out More dnata WIth more than 30 years of experience in Singapore, dnata provides ground-handling services, including passenger and ramp handling, flight catering, as well as cargo handling and security. Find Out More ICA As part of the Ministry of Home Affairs, the Immigration and Checkpoints Authority (ICA) secures Singapore's borders against the entry of undesirable persons and cargo through land, air and sea checkpoints. Find Out More SATS Serving 43 airports and 11 countries, SATS offers gateway services, such as airfreight handling, passenger services, baggage handling, aviation security services, and airline catering. Find Out More ADVERTISING IN CHANGI AIRPORT For brands which are interested in advertising in Changi Airport, please contact: Advertising General Enquiry, JCDecaux Email: sales@jcdecaux.com.sg ADVERTISING PROPOSALS For all advertising proposals for Changi Airport Group, please contact: PHD Media Email: cagmediaplanning@phdmedia.com ON FRAUD AND MISCONDUCT At Changi Airport Group, integrity is at the heart of everything we do. We are committed to conducting business with integrity, consistent with high ethical standards, and complying with all relevant accounting, financial reporting, internal controls, corporate governance and legal requirements wherever we operate. We expect every employee of the Group, as well as other persons acting on behalf of the Group, to maintain these standards. We are committed to promoting a culture of openness and transparency, where our employees, vendors, partners and other stakeholders have a trusted avenue to express concerns on any wrongdoing or behavior that is incompatible with Group policy or the values we espouse. If you have reason to believe that a CAG employee, or anyone acting on behalf of CAG has engaged in illegal or otherwise improper conduct, you should promptly report the matter to CAG via the following Fraud and Ethics hotline: Phone: +65 6603 4949 Post: 60 Airport Boulevard Changi Airport Terminal 2, #04-08 Singapore 819643 Online submission: Click here to submit ** If you feel any of the foregoing reporting channels are not appropriate, then by post, \"Attn: Chairman of Audit Committee\".​ All reports made will be treated with confidence. CAG will not tolerate any kind of retaliation against anyone who, in good faith, reports any concern, irregularity or suspected violations. # For customer enquiries/feedback not relating to fraud, please use the following channels: enquiry@changiairport.com or call +65 6595 6868 (24 hours daily) to speak with our Customer Service Representatives. OFFICE & WAREHOUSE LEASING For Office & Warehouse Leasing, please contact: Email: rentableproperties@changiairport.com SHORT-TERM LEASING For more enquiries, please reach out to us here . About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 5589,
    "word_count": 826,
    "scraped_at": "2025-07-26T15:06:26.637319",
    "metadata": {
      "description": "Don't hesitate to get in touch with us.",
      "language": "en-SG",
      "headings": [
        {
          "level": 2,
          "text": "GETTING TO CORPORATE RECEPTION"
        },
        {
          "level": 2,
          "text": "Need to contact others at CAG?"
        },
        {
          "level": 2,
          "text": "FOR MEDIA-RELATED ENQUIRIES:"
        },
        {
          "level": 2,
          "text": ""
        },
        {
          "level": 2,
          "text": "SPOKESPERSON FOR CAG"
        },
        {
          "level": 2,
          "text": "CAREERS IN CHANGI AIRPORT GROUP"
        },
        {
          "level": 2,
          "text": "ADVERTISING IN CHANGI AIRPORT"
        },
        {
          "level": 2,
          "text": ""
        },
        {
          "level": 2,
          "text": "ADVERTISING PROPOSALS"
        },
        {
          "level": 2,
          "text": "ON FRAUD AND MISCONDUCT"
        }
      ]
    },
    "content_hash": "ef2ee298ed0dc9f78a0863284245a1a0"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/our-media-hub/newsroom.html",
    "title": "Newsroom",
    "content": "Newsroom newsroom Catch up on the latest news and access our downloadable resources. Want to receive media releases from Changi Airport? Sign up here. Subscribe Need to contact others at CAG? Subscribe to our Newsletter Want to receive media releases from Changi Airport? Sign up here Learn More Changi Airport Group Want to speak with someone from Changi Airport Group (CAG)? Do reach out to us if you have enquiries pertaining to media, careers, advertising or whistleblowing. Get in Touch About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 1105,
    "word_count": 160,
    "scraped_at": "2025-07-26T15:06:32.873888",
    "metadata": {
      "description": "See all media releases and bulletins issued by Changi Airport Group since its inception on 1 July 2009. Contact us via our helplines and emails here.",
      "language": "en-SG",
      "headings": [
        {
          "level": 4,
          "text": "About Us"
        },
        {
          "level": 4,
          "text": "Sustainability"
        },
        {
          "level": 4,
          "text": "Partnering Us"
        },
        {
          "level": 4,
          "text": "Media Hub"
        },
        {
          "level": 4,
          "text": "Airport Community"
        },
        {
          "level": 4,
          "text": "Follow Us"
        }
      ]
    },
    "content_hash": "beaad1db95fa927add498ac5d7687a0e"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/our-media-hub/publications/home.html",
    "title": "Publications Home",
    "content": "Publications Home Publications Changi Journeys A monthly e-magazine which presents news and features on Singapore Changi Airport and Changi Airport Group. More Reports Get copies of publications like our annual reports and sustainability reports. More About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 865,
    "word_count": 115,
    "scraped_at": "2025-07-26T15:06:35.890274",
    "metadata": {
      "description": "Keep up with the latest updates and resources from Changi Airport. Visit the Media Hub today for all the recent developments.",
      "language": "en-SG",
      "headings": [
        {
          "level": 4,
          "text": "About Us"
        },
        {
          "level": 4,
          "text": "Sustainability"
        },
        {
          "level": 4,
          "text": "Partnering Us"
        },
        {
          "level": 4,
          "text": "Media Hub"
        },
        {
          "level": 4,
          "text": "Airport Community"
        },
        {
          "level": 4,
          "text": "Follow Us"
        }
      ]
    },
    "content_hash": "5f8c6c3ea03be4c68db78ea4e96a4ca3"
  }
]