[
  {
    "url": "https://www.changiairport.com",
    "title": "Airport",
    "content": "Airport HELLO FROM CHANGI GO PLACES YOU'VE DREAMED OF SG60 Celebrations Join the SG60 fun with a charity walkathon, local performance, lush blooms & a dazzling outdoor light-up for everyone! Your browser does not support HTML video. I AM ARRIVING ARRIVING DEPARTING TRANSITING VISITING USEFUL INFORMATION FOR {DIRECTION} PASSENGERS What’s Happening BLACKPINK WORLD TOUR <DEADLINE> IN SINGAPORE SPEND & WIN PROMOTION Spend S$60 at Changi Airport for a chance to win a pair of tickets. Outlet Deals Shop and save: check out the latest deals! Shop more when you fly! Shop and dine at participating transit stores to be rewarded with free Changi Return e-Vouchers. Kids' Activity Booklet Get an activity booklet when you dine with kids at selected outlets! Tea Time Deal Time Thumbnail New Tea-Time, Deal Time! Visit Changi Airport public areas and unwind with specially-curated tea-time deals. Explore cities we are flying to today View All Kyoto All about onsens & ryokans Rome Top things to see & do Surabaya Perfect for family fun Cebu Best nature activities await Phnom Penh A food journey Melbourne Best day trips Penang Top nature retreats Haikou Recommendations for you Addis Ababa Ethiopia travel guide Jeonju Charming cultural town Bahrain Must-do during your visit Busan Vibrant coastal city Ipoh Weekend getaway guide Sibu Off-the-beaten destination London Best day trips Tokyo Lesser-known spots to visit Amsterdam Hidden gems to visit Bangkok New things to do Jeju The Hawaii of South Korea Hong Kong Lesser-known attractions Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 2396,
    "word_count": 367,
    "scraped_at": "2025-07-26T15:05:19.591939",
    "metadata": {
      "description": "Experience Changi Airport, a world-class service icon and destination in itself. Get flight status, travel guides, shopping and dining tips, and more! ",
      "keywords": "Changi Airport, Arrival, Departure, Transit, Flight Planner, Facilities and Services, Attractions, Shop, Dine, Discover, Changi Rewards, Changi Airport Group",
      "language": "en-IN",
      "headings": [
        {
          "level": 1,
          "text": "HELLO FROM CHANGI"
        },
        {
          "level": 1,
          "text": "Follow us"
        },
        {
          "level": 3,
          "text": "USEFUL INFORMATION FOR {DIRECTION} PASSENGERS"
        },
        {
          "level": 4,
          "text": "BLACKPINK WORLD TOUR <DEADLINE> IN SINGAPORE SPEND & WIN PROMOTION"
        },
        {
          "level": 4,
          "text": "Outlet Deals"
        },
        {
          "level": 4,
          "text": "Shop more when you fly!"
        },
        {
          "level": 4,
          "text": "Kids' Activity Booklet"
        },
        {
          "level": 4,
          "text": "Tea-Time, Deal Time!"
        },
        {
          "level": 4,
          "text": "Fly"
        },
        {
          "level": 4,
          "text": "At Changi"
        }
      ]
    },
    "content_hash": "6ce1f123bdfaaf955c35256c4c479538"
  },
  {
    "url": "https://www.changiairport.com/en/careers.html",
    "title": "Careers",
    "content": "Careers Come Make Magic With Us At Changi Airport Group, we turn airport touch points into seamless experiences using innovation and technology. WHY JOIN US Come make MAGIC with us Discover what it’s like working at Changi Airport Group, where we make magic happen in every aspect of our business – turning different airport touchpoints into seamless experiences with innovation and technology. Get a behind the scenes glimpse of how we have deployed innovative products such as the Auto-Dolly and a baggage tracking application, to transform our work at the airport terminals and airside. Explore Now How we make MAGIC with innovation How do we build the right culture and create spaces for employees to make magic? Tools, training, and a dash of tenacity. Employees are equipped to push the boundaries and conjure innovative solutions for the future of air travel. In our world, anything can become reality through innovation. Explore Now What MAGIC will you make tomorrow? What would you do if you were given a canvas to reimagine the future of air travel? At CAG, employees are encouraged to ask questions, test limits, and explore a plethora of possibilities to stay on top of the game and deliver world-class experiences. Explore Now Life at CAG – it’s MAGIC Hear from our employees as they share candidly about life at CAG. The spirit of camaraderie and community, office perk-me-ups, and overseas bonding trips all contribute to magic beyond the desk. Explore Now Meet our divisions View All AIR HUB AND CARGO DEVELOPMENT Airport Emergency Service Airport Management CHANGI AIRPORTS INTERNATIONAL (CAI) Changi East Development Commercial2.jpg Commercial CORPORATE Engineering and DEVELOPMENT Enterprise Performance and Development PEOPLE An Award-Winning Workplace Our People are our most important asset. That's why we push ourselves to be a better employer each year. We're Here to Help Explore our relevant links to help you get started on a career with us. Job Opportunities Meet Our Divisions Make Magic with Us The CAG story Accolades Our Teams Careers Careers with Changi Airport Group Careers with Changi Airports International Scholarships & Internships Scholarships Internships Useful Tips Hiring process FAQs Contact Information Follow Us Changi Sites : Careers Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 2450,
    "word_count": 384,
    "scraped_at": "2025-07-26T15:05:21.972409",
    "metadata": {
      "description": "Discover what it’s like working at Changi Airport Group, where we make magic happen in every aspect of our business.",
      "keywords": "changi airport career, changi airport jobs, changi airport vacancy, work at changi airport, changi airport group career, airport jobs, airport career singapore, singapore airport careers, cag jobs, airport career, singapore changi airport vacancy, changi group career, changi airport jobs singapore, singapore airport hiring",
      "language": "en-SG",
      "headings": [
        {
          "level": 4,
          "text": "Come make MAGIC with us"
        },
        {
          "level": 4,
          "text": "How we make MAGIC with innovation"
        },
        {
          "level": 4,
          "text": "What MAGIC will you make tomorrow?"
        },
        {
          "level": 4,
          "text": "Life at CAG – it’s MAGIC"
        },
        {
          "level": 4,
          "text": "Make Magic with Us"
        },
        {
          "level": 4,
          "text": "Our Teams"
        },
        {
          "level": 4,
          "text": "Careers"
        },
        {
          "level": 4,
          "text": "Scholarships & Internships"
        },
        {
          "level": 4,
          "text": "Useful Tips"
        },
        {
          "level": 4,
          "text": "Follow Us"
        }
      ]
    },
    "content_hash": "55474f2b88db0b812d689cf98c079245"
  },
  {
    "url": "https://www.changiairport.com/en/careers/job-opportunities.html",
    "title": "Job Opportunities",
    "content": "Job Opportunities CAREERS Join Changi Airport Group, a global aviation hub known for its excellence. Discover a range of job opportunities, from customer service to retail. JOB OPENINGS As a global aviation hub, Changi Airport offers a variety of job opportunities across different fields. Whether you're looking for part-time positions, career advancements, or entry-level openings, Changi Airport is a place where your work impacts millions of travellers around the world. Join us in creating memorable experiences for our passengers and be part of an award-winning team known for its commitment to excellence, diversity, and inclusion. Work with us Changi Airport Group (CAG) Be a part of our exceptional team managing the world’s most awarded airport. Changi Airports International (CAI) Be a part of our strategic team helping partners fulfil their potential of being world-class airports. Frequently Asked Questions About Changi Airport Group Career Opportunities Can I submit my application and/or resume by email? To ensure a holistic and fair assessment of all applications, we encourage you to apply only through our careers portal . We do not accept email applications. Will you let me know when a job has been filled? Only shortlisted applicants will be notified by our recruiters for an interview. If you haven’t heard from us in two months about your application, it is likely that we have proceeded with other candidates for that particular role. What are the application deadlines? And what if I miss the application deadline? For most of our published roles, we accept applications on a rolling basis until the position has been filled. Unless specified in the job description, there is no application deadline, although we encourage you to apply sooner rather than later. If there is a deadline specified in the job description and the deadline has lapsed, we are unable to accept further applications. When will I find out if I am selected for the role after the interview(s)? We send out offers on a rolling basis. The recruiter will contact you to discuss your offer typically within two weeks of your final round interview. Should you not have been advanced through the application process, we will notify you within two weeks of your final round interview. Due to the high volume of applications, we will not be able to provide individual feedback on the outcome of the application. Make Magic with Us The CAG story Accolades Our Teams Careers Careers with Changi Airport Group Careers with Changi Airports International Scholarships & Internships Scholarships Internships Useful Tips Hiring process FAQs Contact Information Follow Us Changi Sites : Careers Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 2850,
    "word_count": 452,
    "scraped_at": "2025-07-26T15:05:24.944378",
    "metadata": {
      "description": "Join Changi Airport Group, a global aviation hub known for its excellence. Discover a range of job opportunities, from customer service to retail.",
      "keywords": "changi airport vacancy, changi airport career opportunities, changi airport hiring, changi airport jobs, changi airport job opening, changi airport job opportunities, changi airport recruitment, changi airport job vacancy, changi airport part time jobs, changi jobs, changi airport jobs for foreigners, changi airport jobs singapore, singapore changi airport vacancy, changi airport customer service jobs, customer service jobs in changi airport, changi airport security jobs, retail jobs at changi airport",
      "language": "en-SG",
      "headings": [
        {
          "level": 3,
          "text": "Can I submit my application and/or resume by email?"
        },
        {
          "level": 3,
          "text": "Will you let me know when a job has been filled?"
        },
        {
          "level": 3,
          "text": "What are the application deadlines? And what if I miss the application deadline?"
        },
        {
          "level": 3,
          "text": "When will I find out if I am selected for the role after the interview(s)?"
        },
        {
          "level": 4,
          "text": "Make Magic with Us"
        },
        {
          "level": 4,
          "text": "Our Teams"
        },
        {
          "level": 4,
          "text": "Careers"
        },
        {
          "level": 4,
          "text": "Scholarships & Internships"
        },
        {
          "level": 4,
          "text": "Useful Tips"
        },
        {
          "level": 4,
          "text": "Follow Us"
        }
      ]
    },
    "content_hash": "05917b4c90ffe08a56eb1472b8792bd6"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/business-expertise/airport-safety-and-security.html",
    "title": "Airport Safety and Security",
    "content": "Airport Safety and Security Airport Safety and Security Your safety is paramount here at Changi Airport. Airport Emergency Service We provide a Category 10 level of fire protection, the highest possible fire protection coverage in accordance to ICAO standards. Airport Emergency Service Team Highly trained and always ready, the Airport Emergency Service (AES) remains on guard 24/7. Their mission is to protect and save lives, minimise property damage, and facilitate the quick return of the Changi aerodrome to normal safety operations. Airport Emergency Plan The Airport Emergency Plan at Changi coordinates the efforts of mutual aid agencies within the airport and its immediate vicinity. The AES team is responsible for managing the Airport Emergency Plan and takes charge of the rescue and fire-fighting and other crash site operations of this plan. This plan is tested annually in the form of full-scale aircraft crash exercises with good support from the mutual aid agencies. AES also responds to other emergency situations within the airport. This includes response to dangerous goods incidents or bomb warnings, as well as chemical or biological threats. Safety Infrastructure At all times, AES fire-fighting vehicles respond to the scene of an aircraft accident in 2 minutes, not exceeding 3 minutes and bring the fires under control within a minute upon arrival. This is swiftly followed by rescue and evacuation efforts to nearby medical facilities. In line with ICAO's recommendation to deal with aircraft crashes in the waters surrounding the airport, AES is equipped with sea rescue capabilities. It has a fleet of emergency resources based in a Sea Rescue Base off the waters of Changi Airport. Operating highly specialised emergency vessels and equipment in the event of aircraft incidents out at sea, the Sea Rescue Base is also the only hovercraft operator in Singapore. Aerodrome Safety The Aerodrome Safety Unit is involved in implementing and maintaining an effective and robust safety management system as well as ensuring compliance with safety regulatory requirements. Safety management system All levels of management and staff are committed to adopting leading practices in managing safety and risks, in line with international and national standards to achieve the highest level of safety performance. The Aerodrome Safety Unit (ASU) is involved in implementing and maintaining an effective and robust safety management system as well as ensuring compliance with safety regulatory requirements. The core functions of the ASU are to: Ensure that all safety processes within the organisation are aligned Monitor the safety performance of operational groups Manage the confidential hazard identification process Provide guidance and advice on safety management matters Changi Airport Group is committed to the establishment of a process where hazards that are likely to jeopardise safety or weaken safety defences are proactively identified and managed. Safety reporting The online hazard reporting application is a voluntary and confidential reporting system that is managed by the ASU. It provides a channel for airport users to report hazards and offer suggestions to address the hazards. No action shall be taken against any personnel who reports a safety concern unless it is due to an illegal act, gross negligence, and/or deliberate or wilful disregard of regulations or procedures. Please click here to report a hazard. In addition to the online hazard reporting channel, airport users who wish to report hazards which require immediate attention may do so at the following 24/7 hotline numbers: +65 6541 2424 (Changi Airport) +65 6481 5077 (Seletar Airport) AVIATION SECURITY Ensuring the safety and security of passengers is critical to all our airport operations. That is why, at Changi Airport, we implement the strictest security measures in line with ICAO recommendations. Security Videos To better inform our staff and visitors on airport security in Changi, we have prepared airport security videos in various languages. English Mandarin Malay Tamil Other Links Airport Operations Traffic Statistics Engineering The Future Air Hub Changi East About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 4798,
    "word_count": 720,
    "scraped_at": "2025-07-26T15:05:28.237700",
    "metadata": {
      "description": "Learn how Changi Airport Group achieves and maintains the highest standards of emergency service and safety performance across operations and more.",
      "keywords": "airport emergency service, changi airport security, singapore airport security, changi airport hotline, airport security, aviation security, safety and security, airport emergency service singapore, changi airport emergency service, airport safety and security procedures, airport safety and security, aerodrome safety",
      "language": "en-SG",
      "headings": [
        {
          "level": 4,
          "text": "About Us"
        },
        {
          "level": 4,
          "text": "Sustainability"
        },
        {
          "level": 4,
          "text": "Partnering Us"
        },
        {
          "level": 4,
          "text": "Media Hub"
        },
        {
          "level": 4,
          "text": "Airport Community"
        },
        {
          "level": 4,
          "text": "Follow Us"
        }
      ]
    },
    "content_hash": "5573b1832cb845354058327b4d7cee5a"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-belief.html",
    "title": "Our Belief",
    "content": "Our Belief Our Belief A passion for quality service is at the heart of all that we do. A PASSION FOR QUALITY SERVICE THE CHANGI EXPERIENCE QUALITY SERVICE MANAGEMENT OUR VISION AND MISSION Our Vision To be a first-in-class, leading global aviation hub run by exceptional people, connecting lives and businesses, contributing to the economic growth of Singapore. Our Mission To be a global leading airport company, anchored in the heart of Asia, pioneering safe, secure, sustainable and vibrant air hubs, ready for our future. Our Values Our values and culture guide us in everything we do. They are the foundation for our decisions and the heart of our organisation. Changi Airport Group is about world-class service, delivered through our passion and culture of excellence. We value our People. We succeed with our Partners. We are committed to our Customers. We lead in our Business. Integrity and service are at the heart of everything we do. OUR BRAND STORY Exceptional People, Connecting Lives Our brand story, ‘Exceptional People, Connecting Lives,’ is visually expressed through our logo. The lines that converge on the Changi ‘I’ symbolise how we unite to serve each customer, caring for them at every stage of their journey. The vibrant lines encircling the globe illustrate how we bring colour and energy to the world by enabling journeys and connecting lives across continents and cultures. These lines also form an ‘S,’ reflecting our commitment to growing a dynamic air hub in Singapore and fostering global connections. Quality Service Management We believe all partners in our airport community must understand the elements that make up the Changi Service DNA and align themselves with the goal of providing quality service. The elements expressed in the Changi Service DNA will foster a stronger service culture and guide the service team in their interactions with our customers at all touchpoints. Personalised To Serve vs To Engage Every customer is unique Be Welcoming Be Sincere Be Attentive Stress-free To Deliver vs To Anticipate To provide customers with peace of mind Be Knowledgeable Be Resourceful Be Reliable Positively Surprising To Satisfy To create good memories in every customer Be Proactive Be Enthusiastic Be Imaginative Delivering Quality Service We believe that everyone in the Changi family has the ability to deliver exceptional service. Our Quality Service Management team collaborates intimately with all our airport partners to deliver exceptional service. Our Changi Service DNA: Personalised, Stress-Free and Positively Surprising– make the 3 key thrusts that ensure customer centricity in all our activities. Service Process Management The Changi Experience is created by design and not by chance. It involves rethinking, redesigning and realigning airport processes to meet the growing expectations of customers. We are steadfast in creating a Changi Experience that brings delight to the customers we interact with, and to achieve a consistent level of service in our daily operations. Learning and Development People competencies are essential in the development of a successful service organisation. We are determined to train and equip our workforce to deliver excellent service to each and every customer. Emphasis is placed on inculcating new staff with the Changi Service DNA. Our core service skills training programme is designed to equip every individual with the skill sets to deliver the Changi way of service. Continuous learning efforts are an integral part of the learning and development roadmap for all airport staff. Service-Driven Initiatives Feedback from our customers sets the foundation for our work, and help us continuously improve our service standards. We seek to connect, communicate, commend, and collaborate with our airport community to drive service excellence through these through service-driven initiatives: a) Creating a high level of Service Awareness b) Promoting contribution with Awards and Recognition c) Seeking out collaborative opportunities through Agency Engagement We reward our service workforce for their good service, exemplify their excellent service acts, and encourage a sense of team responsibility. We also work with our airport partners to ensure all our customers enjoy a delightful and unforgettable Changi Experience. Other Links Explore other relevant links to help you get started and learn more about our airport community. Our Story Our Leadership Awards & Accolades Changi Airports International About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 5119,
    "word_count": 771,
    "scraped_at": "2025-07-26T15:05:30.796656",
    "metadata": {
      "language": "en-SG",
      "headings": [
        {
          "level": 4,
          "text": "About Us"
        },
        {
          "level": 4,
          "text": "Sustainability"
        },
        {
          "level": 4,
          "text": "Partnering Us"
        },
        {
          "level": 4,
          "text": "Media Hub"
        },
        {
          "level": 4,
          "text": "Airport Community"
        },
        {
          "level": 4,
          "text": "Follow Us"
        }
      ]
    },
    "content_hash": "0eaa9f7a4db59d52e644da50a8dd5b3e"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/business-expertise.html",
    "title": "Business Expertise",
    "content": "Business Expertise Business Expertise Our full range of business functions to run the world's most awarded airport Air Hub & Cargo Development Our extensive global connections can help grow your airline and cargo businesses. Explore Airport Operations Efficient operations & airside management ensure we run like clockwork. Explore Changi East Building for the future to secure Changi Airport’s position as a leading air hub. Explore Retail Development Maximising revenue streams by pioneering fresh retail experiences and supporting our partners. Explore Engineering the Future Building a dynamic infrastructure that offers room for future expansion. Explore Safety and Security Enforcing the highest standards of safety and security to give you peace of mind. Explore Traffic Statistics Monthly statistics on passenger, air freight and commercial aircraft movements. Explore About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 1490,
    "word_count": 205,
    "scraped_at": "2025-07-26T15:05:32.760257",
    "metadata": {
      "description": "Find out how Changi Airport Group manages Changi Airport to keep it running smoothly, and grow its capacity to meet travellers' demands.",
      "language": "en-SG",
      "headings": [
        {
          "level": 4,
          "text": "About Us"
        },
        {
          "level": 4,
          "text": "Sustainability"
        },
        {
          "level": 4,
          "text": "Partnering Us"
        },
        {
          "level": 4,
          "text": "Media Hub"
        },
        {
          "level": 4,
          "text": "Airport Community"
        },
        {
          "level": 4,
          "text": "Follow Us"
        }
      ]
    },
    "content_hash": "6043516c5602e10c1eb77a5e505334ce"
  },
  {
    "url": "https://www.changiairport.com/en/corporate.html",
    "title": "Corporate",
    "content": "Corporate Soar to new heights with us RECOMMENDED FOR YOU Leasing Opportunities Find out how we can help your business reach international audiences. Advertising Opportunities Showcase your brand at the world’s most awarded airport. Airline Partnerships Learn how we revolutionise airport retail with partners. ABOUT CHANGI AIRPORT GROUP Our Story & Beliefs Find out all you need to know about Changi and it’s rich aviation history. Learn more Our Subsidiaries Discover the array of subsidiaries and affiliates enriching our company’s ecosystem. Learn more Our Leaders Introducing the inspirational leaders who propel Changi Airport Group’s excellence and progress. Learn more What We Do Air Hub Development We strengthen Changi Airport's connectivity and attractiveness as a vibrant air hub. Read More Airport Operations and Management We manage the operational needs of Changi and Seletar Airports. Read More Retail Management We grow together with our concession partners through continuous innovation. Read More Systems & Technology We provide high quality airport infrastructure for the sustained development of Changi as a world-class air hub. Read More The World’s Most Awarded Airport Recognised awards to date 699 View All Awards Deficiency - Free 2023 International Federation of Air Line Pilots' Association 78th IFALPA Regional Conference 1981 - 2023 Best Airport by Size (over 40mil) and Region (Asia-Pacific) Airports Council International Airport Service Quality 2018 - 2023 Best Airport DestinAsian Readers' Choice Awards 2006 - 2020, 2022 - 2024 Latest News View All News Statistics Changi Airport’s operating indicators for Q2 2025 22 Jul 2025 Jewel Events SG60 celebrations take off at Changi Airport and Jewel with star-studded concert, charity walk, and a dazzling floral extravaganza 25 Jun 2025 Corporate CAI Changi Airport Group signs Memorandum of Understanding with Haikou Meilan International Airport to strengthen cooperation in aviation 16 Jun 2025 Corporate Changi Airport Group awards contract for the construction of Terminal 5’s intra-terminal tunnels 10 Jun 2025 Corporate Fact Sheet: Changi Airport 30 May 2025 Corporate Changi Airport Group results for the year ended 31 March 2025 24 May 2025 Partner with us Whether be it leasing, advertising or investing in the Changi Airport brand, we have an abundance of resources and opportunities for collaboration. See Our Consulting Portfolio Advertise With Us Lease With Us Learn More BUILD YOUR CAREER AT CHANGI CAREER QUICKLINKS Why Join Changi? We offer you the prestige and pride of working in a world-class environment, with abundant opportunities to learn and grow. Read more Meet Our Team At Changi Airport, different divisions come together to make our airport the world's most awarded. Read more About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 3399,
    "word_count": 503,
    "scraped_at": "2025-07-26T15:05:34.990210",
    "metadata": {
      "description": "Official site of Changi Airport Group—a world-class service icon, as well as manager and operator of Singapore Changi Airport, a world-class aviation hub.",
      "language": "en-SG",
      "headings": [
        {
          "level": 1,
          "text": ""
        },
        {
          "level": 2,
          "text": "Partner with us"
        },
        {
          "level": 4,
          "text": "ABOUT CHANGI AIRPORT GROUP"
        },
        {
          "level": 4,
          "text": "Air Hub Development"
        },
        {
          "level": 4,
          "text": "Airport Operations and Management"
        },
        {
          "level": 4,
          "text": "Retail Management"
        },
        {
          "level": 4,
          "text": "Systems & Technology"
        },
        {
          "level": 4,
          "text": "Deficiency - Free 2023"
        },
        {
          "level": 4,
          "text": "Best Airport by Size (over 40mil) and Region (Asia-Pacific)"
        },
        {
          "level": 4,
          "text": "Best Airport"
        }
      ]
    },
    "content_hash": "cf1ed5c28ffad0ec022b157307167169"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/business-expertise/airport-operations-and-management.html",
    "title": "Airport Operations and Management",
    "content": "Airport Operations and Management Airport Operations and Management Efficient operations and management ensure our airport runs like clockwork. TERMINAL OPERATIONS Daily Operations 24/7, 365 days a year, the airport never sleeps. Together with our airport partners, our operations team works relentlessly so that passengers travelling through Changi Airport always enjoy a stress-free experience. Experience Creation Creating a magical experience at Changi Airport is at the heart of everything we do. We offer a wide array of facilities, such as movie theatres, entertainment zones, snooze lounges and gardens. Like our clean and green city, our terminals are also filled with lush greenery.. Planning for Future Developments Planning ahead gets us ready to tackle future challenges and demands. As such, we design new passenger terminals that can adapt to future changes, as well as enhance and transform the passenger experience. One of the bold and revolutionary ideas we implemented is Fast and Seamless Travel (FAST). Now in full operation at Changi Airport, the automated system allows passengers to print their boarding passes and bag tags, as well as check in their luggages themselves. AIRSIDE MANAGEMENT Daily Operations Airside Management makes it safe for aircrafts to take off, land, and taxi at Changi and Seletar Airport. The airside operations team is responsible for many complex and vital tasks on the runways, taxiways, aprons, and beyond airport fences. These tasks include the allocation of aircraft stands and baggage claim belts, testing and issuance of airside driving and vehicular permits, safety inspections, responding to accidents and incidents, audits to mitigate unsafe work practices and wildlife hazard management. Airside Driving Centre To operate any vehicle within Changi Airport's airside, a driver must obtain an Airside Driving Permit. Read more Airside Safety Induction Briefing As part of CAG’s ongoing efforts to enhance safety at Changi's Airside, we have introduced the Airside Safety Induction Briefing. Read more Other Links Airside Driving Centre Airside Safety Induction Briefing Traffic Statistics Engineering The Future Retail Management Safety and Security Changi East About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 2834,
    "word_count": 410,
    "scraped_at": "2025-07-26T15:05:37.342958",
    "metadata": {
      "description": "It takes well-honed precision to run the world’s most acclaimed airport. Learn how the Changi Airport team manages ground, terminal, and airside operations.",
      "language": "en-SG",
      "headings": [
        {
          "level": 4,
          "text": "Airside Driving Centre"
        },
        {
          "level": 4,
          "text": "Airside Safety Induction Briefing"
        },
        {
          "level": 4,
          "text": "About Us"
        },
        {
          "level": 4,
          "text": "Sustainability"
        },
        {
          "level": 4,
          "text": "Partnering Us"
        },
        {
          "level": 4,
          "text": "Media Hub"
        },
        {
          "level": 4,
          "text": "Airport Community"
        },
        {
          "level": 4,
          "text": "Follow Us"
        }
      ]
    },
    "content_hash": "a08eef10fe33700b7e9f35241c25ccb0"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/partnering-us/airport-concessions/airport-retail.html",
    "title": "Airport Retail",
    "content": "Airport Retail Airport Retail The innovative initiatives that differentiate us amongst the dynamic retail environment. REVOLUTIONISING AIRPORT RETAIL The dynamic travel industry is characterised by a fast-changing retail landscape reflective of constantly evolving consumer preferences. To strengthen our position as a competitive air hub, we innovate and create fresh concepts to inject vitality into our transit and public malls, delivering a revolutionary retail experience to the public, passengers and the airport community. Creative Retail Strategies We firmly believe in growing together with our concession partners through continuous innovation and effective collaboration. Through pioneering fresh retail experiences, we are able to offer a wealth of opportunities for retail brands to showcase themselves to the world, creating an ideal place for them to build and grow their businesses. Fresh Retail Experiences Engaging Platforms Unwavering Support Fresh Retail Experiences Changi Pay Changi Pay is your go-to digital payment solution for effortless transactions at Changi Airport and beyond. Partnering with us unlocks exclusive benefits for your customers to enjoy instant savings, collect exclusive weekly offers and rewards while shopping and dining. Join us in enhancing the payment experience for your customers! Find out more Changi First In collaboration with our esteemed partners, we regularly curate exclusive product launches and events to delight travellers. By partnering with us, you’ll amplify your brand's pioneering spirit and secure a first-mover advantage, leaving a lasting impression on your target audience. Find out more You Shop, We Absorb Changi Airport offers an airport-wide 'Flying or Not, You Shop, We Absorb' programme, allowing retailers in the public areas to absorb 9% GST with the free Changi Rewards membership, and creating exceptional value for shoppers. Find out more Engaging Platforms iShopChangi: Our E-commerce Platform Flying or not, shoppers can shop without tax on iShopChangi. As travellers, they can also enjoy the convenience of tax and duty-free purchases from the comfort of their homes or hotel rooms, eliminating the need to rush while in transit at Changi Airport. Find out more Changi Rewards: Loyalty Programme Our rewards programme allows customers to earn points for every dollar spent. Accumulated points can be redeemed for exclusive savings, rewards or rebates. Membership is free. Find out more Unwavering Support Changi Shopping Concierge From luxury and beauty, to fashion and gifts, you can count on our team of expert personal shoppers to be the additional brand ambassadors for your brand. In partnership with you, we collaborate to elevate our passengers’ Changi Retail Experience and build awareness for the products and promotions you offer. Find out more Quality Service Management (QSM) Your continued success is ours too. We work closely with you and your staff to deliver the exceptional Changi Experience: Personalised, Stress-free and Positively Surprising. Customer Discovery and Insights We leverage our experienced team of business analysts and comprehensive data sources to establish a holistic view of our customers, carry out market research, and formulate retail strategies to support your growth and development at Changi Airport. Supporting the Growth of our Stakeholders We are committed to supporting the growth of our airport stakeholders, through the lease of quality rentable premises and competitive aeronautical charges. Quality Rentable Premises It is the collaborative effort of all airport stakeholders that drive the efficient operations at Changi Airport. We lease quality rentable premises, such as offices, lounges and warehouses/storerooms including those within our Changi Airfreight Centre. Competitive Aeronautical Charges Changi Airport is dependent on the successes of our airline partners and airport stakeholders. As such, we ensure our airport charges, including aircraft landing fees, parking. Other Links Airport Operations Traffic Statistics Engineering The Future Safety and Security Changi East About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 4734,
    "word_count": 679,
    "scraped_at": "2025-07-26T15:05:40.370881",
    "metadata": {
      "description": "Discover Changi Airport's innovative retail ideas to deliver unique experiences, exclusive promotions, and a diverse brand selection.",
      "keywords": "innovative retail singapore, changi millionaire, innovative retail, retail experience, airport retail, changi airport retail",
      "language": "en-SG",
      "headings": [
        {
          "level": 4,
          "text": "Changi Pay"
        },
        {
          "level": 4,
          "text": "Changi First"
        },
        {
          "level": 4,
          "text": "You Shop, We Absorb"
        },
        {
          "level": 4,
          "text": "iShopChangi: Our E-commerce Platform"
        },
        {
          "level": 4,
          "text": "Changi Rewards: Loyalty Programme"
        },
        {
          "level": 4,
          "text": "Changi Shopping Concierge"
        },
        {
          "level": 4,
          "text": "Quality Service Management (QSM)"
        },
        {
          "level": 4,
          "text": "Customer Discovery and Insights"
        },
        {
          "level": 4,
          "text": "About Us"
        },
        {
          "level": 4,
          "text": "Sustainability"
        }
      ]
    },
    "content_hash": "b53a0e1ca6a02e11e7dfb425db6f5c30"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/business-expertise/air-hub-development.html",
    "title": "Air Hub Development",
    "content": "Air Hub Development AIR HUB & CARGO DEVELOPMENT We're the region's best gateway to the Asia-Pacific region. The Changi Airport Connectivity Value Proposition Future-ready Infrastructure With 5 passenger terminals, 3 airfreight terminals and 3 runways ready around 2030, Changi Airport is future-proof for the next era of aviation. The Region's Premier Gateway Ranked the top 5 busiest airport in the world in 2023 by Airports Council International World, Changi Airport links Singapore to some 150 cities globally, with close to 100 airlines operating more than 6,900 flights weekly. See our traffic statistics Large Family of Airlines and Alliances With close to 100 airlines in our family and counting, Changi Airport is home to all alliances. oneworld SkyTeam Star Alliance Partner us A Trusted Air Cargo Hub With excellent operating indicators and a growing list of accolades, it is no wonder that Changi Airport is one of the largest airports in the world for international air cargo traffic. See our air cargo operations OTHER LINKS Airport Operations Engineering the Future Innovative Retail Safety and Security Changi East About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Vulnerability Disclosure Policy © 2025 Changi Airport",
    "length": 1744,
    "word_count": 256,
    "scraped_at": "2025-07-26T15:05:42.381143",
    "metadata": {
      "description": "Find out how our connectivity to the world, current and future value proposition, and local dynamic economy makes us a world-class premier aviation hub.",
      "language": "en-SG",
      "headings": [
        {
          "level": 4,
          "text": "About Us"
        },
        {
          "level": 4,
          "text": "Sustainability"
        },
        {
          "level": 4,
          "text": "Partnering Us"
        },
        {
          "level": 4,
          "text": "Media Hub"
        },
        {
          "level": 4,
          "text": "Airport Community"
        },
        {
          "level": 4,
          "text": "Follow Us"
        }
      ]
    },
    "content_hash": "f8ba99ef6d9a4f85c2fdbf088fde9c66"
  }
]